Repository: NhatDo2002/WMS_Application
Catalog: iGMS/App_GlobalResources/Resource.*.resx
Languages: th, zh_cn

# warehouse_fw_create_note
source: Failed to create the goods issue note due to insufficient stock quantity as required!
th: สร้างใบแจ้งการออกสินค้าล้มเหลว เนื่องจากปริมาณสต็อกไม่เพียงพอตามที่กำหนด!
zh_cn: 由于库存数量不足，无法创建发货单！

# warehouse_fw_so_err
source: The SO id
th: รหัส SO
zh_cn: 销售订单ID

# warehouse_fw_so_contain_err
source: contain product which id is:
th: มีสินค้าที่มีรหัส:
zh_cn: 包含物品ID:

# warehouse_fw_so_quantity_err
source: with quantity is:
th: มีปริมาณ:
zh_cn: 数量是：

# warehouse_fw_more
source: The quantity entered exceeds the warehouse's allowable limit!
th: ปริมาณที่ป้อนเกินขีดจำกัดที่อนุญาตของคลังสินค้า!
zh_cn: 输入数量超出仓库允许的限额！

# warehouse_fw_create_fail
source: Transfer creation failed!
th: การสร้างการโอนย้ายล้มเหลว!
zh_cn: 调拨失败！

# warehouse_fw_create_success
source: Transfer created successfully!
th: สร้างการโอนย้ายสำเร็จแล้ว!
zh_cn: 调拨成功！

# approve_auth
source: You do not have permission to approve this form!
th: คุณไม่มีสิทธิ์อนุมัติแบบฟอร์มนี้!
zh_cn: 您没有权限批准此单据！

# approve_none
source: There are no forms to approve!
th: ไม่มีแบบฟอร์มให้อนุมัติ!
zh_cn: 没有要批准的单据！

# export_success
source: Transfer issued successfully
th: โอนย้ายสำเร็จแล้ว
zh_cn: 调拨成功！

# inventory_print
source: INVENTORY LIST
th: รายการสินค้าคงคลัง
zh_cn: 库存列表

# inventory_name
source: Warehouse
th: คลังสินค้า
zh_cn: 仓库名称

# inventory_quantity
source: Stock quantity
th: ปริมาณสต็อก
zh_cn: 库存数量

source: Inventory data
th: ข้อมูลสินค้าคงคลัง
zh_cn: 库存数据

# inventory_idgood
source: Goods id
th: รหัสสินค้า
zh_cn: 商品ID

# warehouse_detail_list_page
source: Warehouse inventory details
th: รายละเอียดสินค้าคงคลังของคลังสินค้า
zh_cn: 仓库库存详情

# warehouse_detail_list_note
source: Check the stock quantity of goods in the warehouses
th: ตรวจสอบปริมาณสต็อกสินค้าในคลังสินค้า
zh_cn: 检查仓库中的商品库存量

# warehouse_detail_list_header
source: Information about the quantity of goods
th: ข้อมูลเกี่ยวกับปริมาณสินค้า
zh_cn: 商品数量信息

# warehouse_detail_list_modal
source: Goods details in the warehouse
th: รายละเอียดสินค้าในคลังสินค้า
zh_cn: 仓库中的商品详情

# warehouse_detail_list_search
source: Searching goods by id...
th: กำลังค้นหาสินค้าตามรหัส...
zh_cn: 按ID搜索商品...

# warehouse_detail_list_gepc
source: Goods details
th: รายละเอียดสินค้า
zh_cn: 商品详情

# inventory_header
source: Inventory details
th: รายละเอียดสินค้าคงคลัง
zh_cn: 库存详情

# inventory_transfer
source: Warehouse transfer
th: การโอนคลังสินค้า
zh_cn: 仓库调拨

# add_search
source: Items have been added to the search list
th: รายการถูกเพิ่มลงในรายการค้นหาแล้ว
zh_cn: 已添加到搜索列表

# Choose_an_option
source: Choose an action
th: เลือกการกระทำ
zh_cn: 选择操作

# account_list_page
source: Account list
th: รายการบัญชี
zh_cn: 账户列表

# account_search
source: Searching user by name...
th: กำลังค้นหาผู้ใช้ตามชื่อ...
zh_cn: 按名称搜索用户...

# account_edit
source: Edit
th: แก้ไขผู้ใช้
zh_cn: 编辑用户

# account_delete
source: Delete
th: ลบผู้ใช้
zh_cn: 删除用户

# account_delete_warning
source: Are you sure you want ot delete this user?
th: คุณแน่ใจหรือไม่ว่าต้องการลบผู้ใช้นี้?
zh_cn: 您确定要删除此用户吗？

# account_create_page
source: Register new account
th: ลงทะเบียนบัญชีใหม่
zh_cn: 注册新用户

# account_edit_pass
source: Change password
th: เปลี่ยนรหัสผ่าน
zh_cn: 修改密码

# permission_not
source: You do not have permission to perform this action!
th: คุณไม่มีสิทธิ์ในการดำเนินการนี้!
zh_cn: 您没有权限执行此操作！

# account_error_char
source: The account must have more than 6 characters!
th: บัญชีต้องมีอักขระมากกว่า 6 ตัว!
zh_cn: 账户必须包含6个以上字符！

# account_error_contain
source: The account can only contain letters and numbers!
th: บัญชีสามารถมีได้เฉพาะตัวอักษรและตัวเลขเท่านั้น!
zh_cn: 账户只能包含字母和数字！

# account_error_pass_length
source: The password must be more than 8 characters!
th: รหัสผ่านต้องมีอักขระมากกว่า 8 ตัว!
zh_cn: 密码必须包含至少8个字符！

# account_error_pass_same
source: Two passwords don't match each other!
th: รหัสผ่านสองรหัสไม่ตรงกัน!
zh_cn: 两个密码不匹配！

# account_error_pass_contain
source: The password must contain at least one special character and one uppercase letter!
th: รหัสผ่านต้องมีอักขระพิเศษอย่างน้อยหนึ่งตัวและตัวพิมพ์ใหญ่อย่างน้อยหนึ่งตัว!
zh_cn: 密码必须包含至少一个特殊字符和一个大写字母！

# account_error_email
source: Invalid email!
th: อีเมลไม่ถูกต้อง!
zh_cn: 电子邮件无效！

# account_error_username
source: Please enter user's fullname!
th: โปรดป้อนชื่อเต็มของผู้ใช้!
zh_cn: 请输入用户全名！

# account_error_auth
source: Please choose at least one role for account!
th: โปรดเลือกบทบาทอย่างน้อยหนึ่งบทบาทสำหรับบัญชี!
zh_cn: 请为用户选择至少一个权限！

# account_error_function
source: Please choose functions for account!
th: โปรดเลือกฟังก์ชันสำหรับบัญชี!
zh_cn: 请为账户选择功能！

# account_error_username_same
source: This username is already exist!
th: ชื่อผู้ใช้นี้มีอยู่แล้ว!
zh_cn: 此用户名已存在！

# data_no
source: No data requested!
th: ไม่มีข้อมูลที่ร้องขอ!
zh_cn: 没有请求的数据！

# account_error_nofind
source: Cannot find this account in system!
th: ไม่พบบัญชีนี้ในระบบ!
zh_cn: 未在系统中找到此账户！

# account_error_lock
source: The account has been locked. Contact the administrator to unlock it!
th: บัญชีถูกล็อกแล้ว โปรดติดต่อผู้ดูแลระบบเพื่อปลดล็อก!
zh_cn: 此账户已被锁定，请联系管理员解锁！

# account_pass_change
source: Change password successfully!
th: เปลี่ยนรหัสผ่านสำเร็จแล้ว!
zh_cn: 密码修改成功！

# account_error_passnew
source: The new password confirmation is incorrect!
th: การยืนยันรหัสผ่านใหม่ไม่ถูกต้อง!
zh_cn: 新密码确认不正确！

# account_error_oldpassnew
source: The new password is the same as the old password!
th: รหัสผ่านใหม่เหมือนกับรหัสผ่านเก่า!
zh_cn: 新密码与旧密码相同！

# account_error_pass_incorrect
source: The password is incorrect!
th: รหัสผ่านไม่ถูกต้อง!
zh_cn: 密码不正确！

# account_error_pass_count_lock
source: The account has entered the wrong password
th: บัญชีได้ป้อนรหัสผ่านผิด
zh_cn: 账户输入密码错误

# account_error_pass_time_will
source: times, it will be locked after
th: ครั้ง จะถูกล็อกหลังจาก
zh_cn: 次，之后将被锁定

# account_error_pass_wrong_more
source: more incorrect attempts!
th: ความพยายามผิดพลาดเพิ่มเติม!
zh_cn: 次错误尝试！

# account_error_pass_locked
source: The account has been locked due to 5 consecutive incorrect password attempts!
th: บัญชีถูกล็อกเนื่องจากการพยายามป้อนรหัสผ่านผิดติดต่อกัน 5 ครั้ง!
zh_cn: 账户因连续5次输入错误密码而被锁定！

# account_error_no_exist
source: The account isn't exist!
th: บัญชีไม่มีอยู่!
zh_cn: 账户不存在！

# account_user_list_print
source: USER LIST
th: รายการผู้ใช้
zh_cn: 用户列表

# account_require
source: Please enter all the required information!
th: โปรดป้อนข้อมูลที่จำเป็นทั้งหมด!
zh_cn: 请填写所有必填信息！

# account_error_enter_email
source: Please enter email!
th: โปรดป้อนอีเมล!
zh_cn: 请输入电子邮件！

# account_error_phone
source: Please enter phone number!
th: โปรดป้อนหมายเลขโทรศัพท์!
zh_cn: 请输入电话号码！

# account_error_phone_invalid
source: Invalid phone number!
th: หมายเลขโทรศัพท์ไม่ถูกต้อง!
zh_cn: 电话号码无效！

# account_choose_role
source: Choosing role for account...
th: เลือกบทบาทสำหรับบัญชี...
zh_cn: 选择账户权限...

# account_edit_success
source: User information updated successfully!
th: อัปเดตข้อมูลผู้ใช้สำเร็จแล้ว!
zh_cn: 用户信息更新成功！

# account_error_account
source: Please enter username!
th: โปรดป้อนชื่อผู้ใช้!
zh_cn: 请输入账户名！

# account_error_enter_pass
source: Please enter password!
th: โปรดป้อนรหัสผ่าน!
zh_cn: 请输入密码！

# account_error_pass_upper
source: The password must contain at least one uppercase letter!
th: รหัสผ่านต้องมีตัวพิมพ์ใหญ่อย่างน้อยหนึ่งตัว!
zh_cn: 密码必须包含至少1个大写字母！

# account_error_pass_syntax
source: The password must contain at least one special character!
th: รหัสผ่านต้องมีอักขระพิเศษอย่างน้อยหนึ่งตัว!
zh_cn: 密码必须包含至少一个特殊字符！

# account_error_pass_num
source: The password must contain at least one number!
th: รหัสผ่านต้องมีตัวเลขอย่างน้อยหนึ่งตัว!
zh_cn: 密码必须包含至少一个数字！

# account_error_pass_3continue
source: The password must not contain consecutive characters of 3 or more!
th: รหัสผ่านต้องไม่มีอักขระต่อเนื่อง 3 ตัวขึ้นไป!
zh_cn: 密码不能包含3个或以上连续字符！

# account_error_pass_reenter
source: Please re-enter password!
th: โปรดป้อนรหัสผ่านอีกครั้ง!
zh_cn: 请重新输入密码！

# account_create_success
source: Register new account successfully!
th: ลงทะเบียนบัญชีใหม่สำเร็จแล้ว!
zh_cn: 新账户注册成功！

# customer_type_list_page
source: Customer types list
th: รายการประเภทลูกค้า
zh_cn: 客户类型列表

# customer_type_search
source: Searching customer type by id...
th: กำลังค้นหาประเภทลูกค้าตามรหัส...
zh_cn: 按ID搜索客户类型...

# customer_type_print
source: CUSTOMER TYPE LIST
th: รายการประเภทลูกค้า
zh_cn: 客户类型列表

# customer_type_edit
source: Edit
th: แก้ไข
zh_cn: 编辑客户类型

# customer_type_delete
source: Delete
th: ลบ
zh_cn: 删除客户类型

# customer_type_warning
source: Are you sure you want to delete this customer type?
th: คุณแน่ใจหรือไม่ว่าต้องการลบประเภทลูกค้านี้?
zh_cn: 您确定要删除此客户类型吗？

# customer_list_page
source: Customer list
th: รายชื่อลูกค้า
zh_cn: 客户列表

# customer_search
source: Searching customer by name...
th: กำลังค้นหาลูกค้าตามชื่อ...
zh_cn: 按名称搜索客户...

# customer_print
source: CUSTOMER LIST
th: รายการลูกค้า
zh_cn: 客户列表

# customer_edit
source: Edit
th: แก้ไข
zh_cn: 编辑客户

# customer_delete
source: Delete
th: ลบ
zh_cn: 删除客户

# customer_warning
source: Are you sure you want to delete this customer?
th: คุณแน่ใจหรือไม่ว่าต้องการลบลูกค้ารายนี้?
zh_cn: 您确定要删除此客户吗？

# customer_work
source: Still working
th: ยังคงทำงาน
zh_cn: 仍在工作

# customer_end
source: Collaboration terminated
th: สิ้นสุดความร่วมมือ
zh_cn: 合作终止

# permission_search
source: Searching permission by name...
th: กำลังค้นหาสิทธิ์ตามชื่อ...
zh_cn: 按名称搜索权限...

# permission_print
source: PERMISSION LIST
th: รายการสิทธิ์
zh_cn: 权限列表

# status_work
source: Still working
th: ยังคงทำงาน
zh_cn: 正在工作

# status_notwork
source: Stop working
th: หยุดทำงาน
zh_cn: 停止工作

# permission_delete_warning
source: Are you sure you want to delete this permission?
th: คุณแน่ใจหรือไม่ว่าต้องการลบสิทธิ์นี้?
zh_cn: 您确定要删除此权限吗？

# permission_edit
source: Edit
th: แก้ไข
zh_cn: 编辑

# permission_delete
source: Delete
th: ลบ
zh_cn: 删除权限

# error_permission_name
source: Please enter permission name!
th: โปรดป้อนชื่อสิทธิ์!
zh_cn: 请输入权限名称！

# error_function
source: Please choose at least one function for this permission!
th: โปรดเลือกฟังก์ชันอย่างน้อยหนึ่งฟังก์ชันสำหรับสิทธิ์นี้!
zh_cn: 请为此权限选择至少一个功能！

# error_add_function
source: Adding into system has some problems!
th: การเพิ่มเข้าสู่ระบบมีปัญหาบางอย่าง!
zh_cn: 添加到系统时出现问题！

# error_permission_hasalready
source: Permission is already exist!
th: สิทธิ์มีอยู่แล้ว!
zh_cn: 权限已存在！

# error_permission_notexist
source: Permission is not exist in system!
th: สิทธิ์ไม่มีอยู่ในระบบ!
zh_cn: 权限在系统中不存在！

# error_permission_delete
source: There is no permission in system to delete!
th: ไม่มีสิทธิ์ในระบบที่จะลบ!
zh_cn: 系统中没有可删除的权限！

# active
source: Still in use
th: ยังใช้งานอยู่
zh_cn: 仍在启用

# no_active
source: No longer in use
th: ไม่มีการใช้งานอีกต่อไป
zh_cn: 不再使用

# password_enter
source: Enter password...
th: ป้อนรหัสผ่าน...
zh_cn: 输入密码...

# password_confirm
source: Confirm password...
th: ยืนยันรหัสผ่าน...
zh_cn: 确认密码...

source: Function name
th: ชื่อฟังก์ชัน
zh_cn: 功能名称

# function_search
source: Searching function by name...
th: กำลังค้นหาฟังก์ชันตามชื่อ...
zh_cn: 按名称搜索功能...

# name_placeholder
source: Enter user's name...
th: ป้อนชื่อผู้ใช้...
zh_cn: 输入用户名...

# email_placeholder
source: Enter email...
th: ป้อนอีเมล...
zh_cn: 输入电子邮件...

# account_placeholder
source: Enter username...
th: ป้อนชื่อผู้ใช้...
zh_cn: 输入账户名...

# phone_placeholder
source: Enter phone number...
th: ป้อนหมายเลขโทรศัพท์...
zh_cn: 输入电话号码...

# address_placeholder
source: Enter address...
th: ป้อนที่อยู่...
zh_cn: 输入地址...

# des_placeholder
source: Enter description...
th: ป้อนคำอธิบาย...
zh_cn: 输入描述...

# permission_placeholder
source: Enter permission's name...
th: ป้อนชื่อสิทธิ์...
zh_cn: 输入权限名称...

# purchase_id_error
source: Purchase order id is not exist!
th: รหัสใบสั่งซื้อไม่มีอยู่!
zh_cn: 采购订单ID不存在！

# purchase_approve
source: The purchase order is approved!
th: ใบสั่งซื้อได้รับการอนุมัติแล้ว!
zh_cn: 采购订单已获批准！

# approve_success
source: Approve successfully!
th: อนุมัติสำเร็จแล้ว!
zh_cn: 批准成功！

# delete_form_auth
source: You don't have permission to delete this form!
th: คุณไม่มีสิทธิ์ลบแบบฟอร์มนี้!
zh_cn: 您没有权限删除此单据！

# scan_form_approve_delete
source: Approved scan record cannot be deleted!
th: บันทึกการสแกนที่ได้รับการอนุมัติแล้วไม่สามารถลบได้!
zh_cn: 已批准的扫描记录无法删除！

# purchase_delete_error
source: The receipt has goods added to the warehouse and cannot be deleted!
th: ใบเสร็จมีสินค้าที่เพิ่มในคลังสินค้าแล้วและไม่สามารถลบได้!
zh_cn: 收货单已添加商品到仓库，无法删除！

source: Actual import
th: การนำเข้าจริง
zh_cn: 实际入库

# purchase_search_id
source: Searching purchase order by id...
th: กำลังค้นหาใบสั่งซื้อตามรหัส...
zh_cn: 按ID搜索采购订单...

# purchase_print
source: PURCHASE ORDER
th: ใบสั่งซื้อ
zh_cn: 采购订单

# purchase_print_id
source: PO ID:
th: รหัส PO:
zh_cn: 采购订单ID:

source: Debit:
th: เดบิต:
zh_cn: 借方:

source: Credit:
th: เครดิต:
zh_cn: 贷方:

source: Receipt ID
th: รหัสใบเสร็จ
zh_cn: 收货ID

# scan_process
source: Data scanning processing
th: การประมวลผลการสแกนข้อมูล
zh_cn: 数据扫描处理

# scan_list
source: Scan record list
th: รายการบันทึกการสแกน
zh_cn: 扫描记录列表

# approve_po
source: Approve goods reiceipt
th: อนุมัติการรับสินค้า
zh_cn: 批准收货

# purchase_delete
source: Delete good receipt
th: ลบใบรับสินค้า
zh_cn: 删除收货单

# purchase_print_btn
source: Print goods receipt
th: พิมพ์ใบรับสินค้า
zh_cn: 打印收货单

# purchase_id
source: Purchase order ID
th: รหัสใบสั่งซื้อ
zh_cn: 采购订单ID

# purchase_scan_ID
source: Scan record ID
th: รหัสบันทึกการสแกน
zh_cn: 扫描记录ID

# purchase_good_status
source: Goods receiving status
th: สถานะการรับสินค้า
zh_cn: 收货状态

# purchase_receive
source: Received
th: ได้รับ
zh_cn: 已收货

# purchase_pending
source: Pending
th: รอดำเนินการ
zh_cn: 待入库

# approve_scan
source: Approve scan record
th: อนุมัติบันทึกการสแกน
zh_cn: 批准扫描记录

# scan_delete
source: Delete scan record
th: ลบบันทึกการสแกน
zh_cn: 删除扫描记录

# purchase_confirm
source: Confirm to approve this purchase order?
th: ยืนยันการอนุมัติใบสั่งซื้อนี้หรือไม่?
zh_cn: 确认批准此采购订单吗？

# purchase_not_approve
source: The purchase order is not approved!
th: ใบสั่งซื้อยังไม่ได้รับการอนุมัติ!
zh_cn: 采购订单尚未批准！

# purchase_cancle
source: The purchase order is cancled!
th: ใบสั่งซื้อถูกยกเลิกแล้ว!
zh_cn: 采购订单已取消！

# confirm_all_scan
source: Confirm to approve all the scan records?
th: ยืนยันการอนุมัติบันทึกการสแกนทั้งหมดหรือไม่?
zh_cn: 确认批准所有扫描记录吗？

# confirm_scan
source: Confirm to approve this scan record?
th: ยืนยันการอนุมัติบันทึกการสแกนนี้หรือไม่?
zh_cn: 确认批准此扫描记录吗？

# confirm_delete_scan_data
source: Confirm to delete this scaned data?
th: ยืนยันการลบข้อมูลที่สแกนแล้วนี้หรือไม่?
zh_cn: 确认删除此扫描数据吗？

# confirm_delete_po
source: Confirm to delete this purchase order?
th: ยืนยันการลบใบสั่งซื้อนี้หรือไม่?
zh_cn: 确认删除此采购订单吗？

# export_id
source: Goods issue ID
th: รหัสการออกสินค้า
zh_cn: 出库ID

# approve_so
source: Approve goods issue
th: อนุมัติการออกสินค้า
zh_cn: 批准发货

# sale_confirm
source: Confirm to approve this sale order?
th: ยืนยันการอนุมัติใบสั่งขายนี้หรือไม่?
zh_cn: 确认批准此销售订单吗？

# sale_delete
source: Delete goods issue
th: ลบการออกสินค้า
zh_cn: 删除出库单

# confirm_delete_so
source: Confirm to delete this sale order?
th: ยืนยันการลบใบสั่งขายนี้หรือไม่?
zh_cn: 确认删除此销售订单吗？

# sale_print_btn
source: Print goods issue
th: พิมพ์การออกสินค้า
zh_cn: 打印出库单

# sale_search_id
source: Searching sale order by id...
th: กำลังค้นหาใบสั่งขายตามรหัส...
zh_cn: 按ID搜索销售订单...

# sale_good_status
source: Goods exporting status
th: สถานะการส่งออกสินค้า
zh_cn: 出库状态

# sale_export
source: Exported
th: ส่งออกแล้ว
zh_cn: 已出库

# sale_pending
source: Pending
th: รอดำเนินการ
zh_cn: 待出库

# scan_not_do
source: Cannot proccess this action
th: ไม่สามารถดำเนินการนี้ได้
zh_cn: 无法执行此操作

# scan_not_approve_yet
source: This sale order is not approved yet!
th: ใบสั่งขายนี้ยังไม่ได้รับการอนุมัติ!
zh_cn: 此销售订单尚未批准！

# appove_all_scan_confirm
source: Confirm to approve all the scan records?
th: ยืนยันการอนุมัติบันทึกการสแกนทั้งหมดหรือไม่?
zh_cn: 确认批准所有扫描记录吗？

# reciept_noID_error
source: Scan record ID is required!
th: ต้องระบุรหัสบันทึกการสแกน!
zh_cn: 需要扫描记录ID

# reciept_noPOID_error
source: Purchase order ID is required!
th: ต้องระบุรหัสใบสั่งซื้อ!
zh_cn: 需要采购订单ID！

# receipt_poIDinvalid_error
source: Invalided purchase order ID!
th: รหัสใบสั่งซื้อไม่ถูกต้อง!
zh_cn: 采购订单ID无效！

# receipt_noDataScan_error
source: No scanned data requested!
th: ไม่มีข้อมูลที่สแกนที่ร้องขอ!
zh_cn: 没有扫描数据！

# receipt_dupicated_error
source: Duplicated with a tag existed in system!
th: ซ้ำกับแท็กที่มีอยู่ในระบบ!
zh_cn: 系统中已存在重复的标签码！

# receipt_exist_error
source: This scan record ID is existed in system!
th: รหัสบันทึกการสแกนนี้มีอยู่ในระบบแล้ว!
zh_cn: 此扫描记录ID已存在于系统中！

# receipt_nothing_error
source: There is no scan record to add to inventory!
th: ไม่มีบันทึกการสแกนที่จะเพิ่มในสินค้าคงคลัง!
zh_cn: 没有要添加到库存的扫描记录！

# receipt_approve_success
source: Approval successful, inventory has been updated!
th: อนุมัติสำเร็จแล้ว อัปเดตสินค้าคงคลังแล้ว!
zh_cn: 批准成功，库存已更新！

# receipt_approveAlready_error
source: The scan record has been approved!
th: บันทึกการสแกนได้รับการอนุมัติแล้ว!
zh_cn: 此扫描记录已获批准！

# cancle_record
source: Cancle scan record!
th: ยกเลิกบันทึกการสแกน!
zh_cn: 取消扫描记录！

# reciept_nodata_error
source: No data available for the import record!
th: ไม่มีข้อมูลสำหรับบันทึกการนำเข้า!
zh_cn: 无单据数据！

# sale_approve
source: The sale order is approved!
th: ใบสั่งขายได้รับการอนุมัติแล้ว!
zh_cn: 销售订单已获批准！

source: Approve failed!
th: อนุมัติไม่สำเร็จ!
zh_cn: 批准失败！

# delivery_soID_error
source: The sale order ID is not existed!
th: รหัสใบสั่งขายไม่มีอยู่!
zh_cn: 销售订单ID不存在！

# delivery_exported_error
source: The record already has items exported from the warehouse and cannot be deleted!
th: บันทึกมีรายการที่ส่งออกจากคลังสินค้าแล้วและไม่สามารถลบได้!
zh_cn: 此记录已包含从仓库发货的物品，无法删除！

# process_error
source: There was an error processing the data!
th: เกิดข้อผิดพลาดในการประมวลผลข้อมูล!
zh_cn: 处理数据时出错！

# sale_noexist
source: The sale order does not exist in the system!
th: ใบสั่งขายไม่มีอยู่ในระบบ!
zh_cn: 系统中不存在此销售订单！

# scan_add_successfully
source: Save scan record successfully!
th: บันทึกการสแกนสำเร็จแล้ว!
zh_cn: 保存扫描记录成功！

# scan_ID_error
source: This Scan record ID does not exist in system!
th: รหัสบันทึกการสแกนนี้ไม่มีอยู่ในระบบ!
zh_cn: 此扫描记录ID不存在于系统中！

# sale_wh_error
source: Please select a warehouse!
th: โปรดเลือกคลังสินค้า!
zh_cn: 请选择一个仓库！

# sale_inventory_error
source: Insufficient inventory!
th: สินค้าคงคลังไม่เพียงพอ!
zh_cn: 库存不足

# save_success
source: Save successfully!
th: บันทึกสำเร็จแล้ว!
zh_cn: 保存成功！

# sale_lessInven_error
source: has insufficient inventory!
th: มีสินค้าคงคลังไม่เพียงพอ!
zh_cn: 库存不足！

# search_stock
source: Searching stocktake by id...
th: กำลังค้นหาการนับสต็อกตามรหัส...
zh_cn: 按ID搜索盘点单...

# stock_unverified_list
source: List of unverified codes
th: รายการรหัสที่ยังไม่ได้รับการตรวจสอบ
zh_cn: 未验证代码列表

# stock_delete
source: Delete stock-take
th: ลบการนับสต็อก
zh_cn: 删除盘点单

# stock_print
source: Print stock-take
th: พิมพ์การนับสต็อก
zh_cn: 打印盘点单

# stock_scaned
source: Scanned quantity
th: ปริมาณที่สแกน
zh_cn: 扫描数量

# stock_missepc_list
source: List of goods not scanned
th: รายการสินค้าที่ไม่ได้สแกน
zh_cn: 缺少商品列表

# stock_fullcheck
source: Verified complete
th: ยืนยันเสร็จสมบูรณ์
zh_cn: 已盘点完成

# stock_notcomplete
source: Not completed
th: ยังไม่เสร็จ
zh_cn: 未完成盘点

# stock_confirmDelete
source: Confirm to delete this stock-take?
th: ยืนยันการลบการนับสต็อกนี้หรือไม่?
zh_cn: 确认删除此盘点单吗？

# stock_list_page
source: Stock count list
th: รายการนับสต็อก
zh_cn: 盘点单列表

# stock_invalid_error
source: Invalid stock-take ID!
th: รหัสการนับสต็อกไม่ถูกต้อง!
zh_cn: 盘点单号无效！

# stock_exist_error
source: This stock-take does not exist in system!
th: การนับสต็อกนี้ไม่มีอยู่ในระบบ!
zh_cn: 此盘点单在系统中不存在！

# warning_list
source: List of Warning Goods
th: รายการสินค้าที่ต้องระวัง
zh_cn: 警告商品列表

# stock_create
source: Create stock-take successfully!
th: สร้างการนับสต็อกสำเร็จแล้ว!
zh_cn: 创建盘点单成功！

# belong_wh
source: Belongs to warehouse
th: เป็นของคลังสินค้า
zh_cn: 属于仓库

# different_from
source: different from the warehouse specified in the document!
th: แตกต่างจากคลังสินค้าที่ระบุในเอกสาร!
zh_cn: 与单据中指定的仓库不同！

source: Unidentified!
th: ไม่ระบุ!
zh_cn: 未识别！

# no_goods_scanned
source: No items have been scanned to save the scan record!
th: ยังไม่มีรายการใดถูกสแกนเพื่อบันทึกการสแกน!
zh_cn: 未扫描任何物品以保存扫描记录！

# warning_list_page
source: List of warning goods
th: รายการสินค้าที่ต้องระวัง
zh_cn: 警告商品列表

# confirm_delete_recordInfo
source: Are you sure you want to delete this recorded information?
th: คุณแน่ใจหรือไม่ว่าต้องการลบข้อมูลที่บันทึกไว้นี้?
zh_cn: 您确定要删除此记录信息吗？

# device_name
source: Device
th: อุปกรณ์
zh_cn: 设备

source: Record date
th: วันที่บันทึก
zh_cn: 记录日期

# data_noexist
source: Data does not exist in the system!
th: ข้อมูลไม่มีอยู่ในระบบ!
zh_cn: 数据在系统中不存在！

# noti_po
source: Purchase order ID
th: รหัสใบสั่งซื้อ
zh_cn: 采购订单ID

# noti_notapprove
source: is not approved yet.
th: ยังไม่ได้รับการอนุมัติ
zh_cn: 未批准。

# noti_so
source: Sale order ID
th: รหัสใบสั่งขาย
zh_cn: 销售订单ID

# formisnotinthecorrectformat
source: is incorrect format!!!
th: รูปแบบไม่ถูกต้อง!!!
zh_cn: 格式不正确！！！

# coincide
source: is coincide with
th: ตรงกับ
zh_cn: 与...一致

# check_warehouse
source: From warehouse
th: จากคลังสินค้า
zh_cn: 从仓库检查

source: Barcode scan
th: การสแกนบาร์โค้ด
zh_cn: 条码扫描处理

# serial
source: Identifier code
th: รหัสระบุ
zh_cn: 标识码

# goods_barcode_detail
source: More details
th: รายละเอียดเพิ่มเติม
zh_cn: 更多详情

# SKU
source: Stock keeping unit
th: หน่วยเก็บสต็อก
zh_cn: SKU

# reference
source: Reference code
th: รหัสอ้างอิง
zh_cn: 参考代码

# scan_process_data
source: Scanned Goods Data
th: ข้อมูลสินค้าที่สแกนแล้ว
zh_cn: 扫描的商品数据

# not_included_in_form
source: Not included in the form!
th: ไม่รวมอยู่ในแบบฟอร์ม!
zh_cn: 不在单据中！

# not_know_match_sku
source: The scanned identifier matches multiple SKUs on the PO! The system cannot determine the correct SKU
th: รหัสที่สแกนตรงกับ SKU หลายรายการในใบสั่งซื้อ! ระบบไม่สามารถระบุ SKU ที่ถูกต้องได้
zh_cn: 扫描到的标识符与单据上的多个 SKU 重复！系统无法确定对应的 SKU。

source: Empty barcode!
th: บาร์โค้ดว่างเปล่า!
zh_cn: 空条码！

# quantity_export
source: The quantity of goods with code
th: ปริมาณสินค้าที่มีรหัส
zh_cn: 商品数量

# currently_not_enough
source: currently is not enough to proceed with the outbound operation with this quantity
th: ปัจจุบันไม่เพียงพอที่จะดำเนินการส่งออกด้วยปริมาณนี้
zh_cn: 当前数量不足以执行此出库操作。

source: Goods with id
th: สินค้าที่มีรหัส
zh_cn: 商品ID

# not_exists_in_system
source: does not exist in the system. Please check again.
th: ไม่มีอยู่ในระบบ โปรดตรวจสอบอีกครั้ง
zh_cn: 系统中不存在。请重新检查。

# warehouse_combo
source: Warehouse
th: คลังสินค้า
zh_cn: 选择仓库

# inventory_wh_name
source: Warehouse
th: คลังสินค้า
zh_cn: 仓库

# Thailand
source: Thai
th: ภาษาไทย
zh_cn: 泰语

source: Enter SKU
th: กรอก SKU
zh_cn: 输入 SKU

# enter_reference
source: Enter product reference code
th: กรอกรหัสอ้างอิงของสินค้า
zh_cn: 输入产品参考代码

# cannot_proccess_rfid_from_barcode_form
source: This PO has already been scanned using a barcode! Scanning with RFID is not allowed because the data will not match.
th: ใบสั่งซื้อ (PO) นี้ได้ถูกสแกนด้วยบาร์โค้ดแล้ว! ไม่สามารถสแกนด้วย RFID ได้ เนื่องจากข้อมูลจะไม่ตรงกัน
zh_cn: 此采购订单已使用条码扫描！不允许使用 RFID 扫描，因为数据将不匹配

# invalid_input_create
source: Items with invalid input quantities:
th: รายการสินค้าที่มีจำนวนที่ป้อนไม่ถูกต้อง:
zh_cn: 输入数量无效的物品：

# please_enter_reference
source: Please enter the product reference code
th: กรุณากรอกรหัสอ้างอิงของสินค้า
zh_cn: 请输入产品参考代码

# please_enter_sku
source: Please enter the SKU
th: กรุณากรอก SKU
zh_cn: 请输入 SKU

# sku_identifier_exists
source: This product reference code already exists
th: รหัสอ้างอิงสำหรับผลิตภัณฑ์นี้มีอยู่แล้ว
zh_cn: 此产品参考代码已存在

# stock_valid
source: Valid inventory check form!
th: ใบตรวจนับสินค้ามีผลบังคับใช้!
zh_cn: 盘点单号有效！

# stock_enter
source: Please enter the inventory check code!
th: กรุณากรอกรหัสใบตรวจนับสินค้า!
zh_cn: 请输入盘点单号！
