Repository: NhatDo2002/WMS_Application
Catalog: iGMS/App_GlobalResources/Resource.*.resx
Languages: th, zh_cn

# trùng tên đơn vị
source: Unit Name Already In The System !!!
th: ชื่อหน่วยมีอยู่ในระบบแล้ว!!!
zh_cn: 单位名称已在系统中！！！

source: Status
th: สถานะ
zh_cn: 状态

# Trạng Thái Nhập Kho
source: Status
th: สถานะ
zh_cn: 入库状态

# Trạng Thái Phiếu Kiểm
source: Stock Take Status
th: สถานะการนับสต็อก
zh_cn: 盘点单状态

source: Inventory status
th: สถานะสินค้าคงคลัง
zh_cn: 库存状态

# Trạng Thái Xuất Kho
source: Status
th: สถานะ
zh_cn: 出库状态

# Tài Khoản
source: User Name
th: ชื่อผู้ใช้
zh_cn: 用户名

source: Bank account
th: บัญชีธนาคาร
zh_cn: 银行账户

# Tên
source: Name
th: ชื่อ
zh_cn: 名称

source: Data
th: ข้อมูล
zh_cn: 数据

# good_name
source: Goods name
th: ชื่อสินค้า
zh_cn: 商品名称

# Tên Hàng Hóa
source: Goods Name
th: ชื่อสินค้า
zh_cn: 商品名称

source: Warehouse name
th: ชื่อคลังสินค้า
zh_cn: 仓库名称

# Tên Kho Hàng
source: Warehouse Name
th: ชื่อคลังสินค้า
zh_cn: 仓库名称

source: Customer name
th: ชื่อลูกค้า
zh_cn: 客户名称

# Tên Loại Khách Hàng
source: Customer Type Name
th: ชื่อประเภทลูกค้า
zh_cn: 客户类型名称

# Tên Máy Chủ
source: Server Name
th: ชื่อเซิร์ฟเวอร์
zh_cn: 服务器名称

# Tên Nhóm Hàng
source: Group Goods Name
th: ชื่อกลุ่มสินค้า
zh_cn: 商品组名称

# Tên Vật Tư
source: Asset Name
th: ชื่อสินทรัพย์
zh_cn: 物料名称

source: Username
th: ชื่อผู้ใช้
zh_cn: 用户名

# Tên Đơn Vị
source: Unit Name
th: ชื่อหน่วย
zh_cn: 单位名称

source: Name, Bank account
th: ชื่อ, บัญชีธนาคาร
zh_cn: 名称，银行账户

source: Search
th: ค้นหา
zh_cn: 搜索

# epc_search
source: Search for EPC code
th: ค้นหารหัส EPC
zh_cn: 搜索 EPC 代码

# Tìm Mã Hàng
source: Search Goods Id
th: ค้นหารหัสสินค้า
zh_cn: 搜索商品ID

# Tìm Mã Phiếu Kiểm
source: Search Stock id
th: ค้นหารหัสสต็อก
zh_cn: 搜索盘点单号

# Tìm Mã Phiếu Nhập
source: Search Purchase Order id
th: ค้นหารหัสใบสั่งซื้อ
zh_cn: 搜索采购订单号

# Tìm Mã Phiếu Xuất
source: Search Sale Order id
th: ค้นหารหัสใบสั่งขาย
zh_cn: 搜索销售订单号

# Tạo Phiếu Nhập Hàng Thành Công
source: Create Successfullly Purchase Order!
th: สร้างใบสั่งซื้อสำเร็จ!
zh_cn: 创建采购订单成功！

# Tạo Phiếu Nhập kho
source: Create Goods Receipt
th: สร้างใบรับสินค้า
zh_cn: 创建入库单

# Tạo Phiếu Xuất Hàng Thành Công
source: Create Successful Sales Order
th: สร้างใบสั่งขายสำเร็จ
zh_cn: 创建销售订单成功

# Tạo Phiếu Xuất Kho
source: Create Goods Delivery
th: สร้างการจัดส่งสินค้า
zh_cn: 创建出库单

# Tạo Đơn
source: Submit
th: ส่ง
zh_cn: 提交订单

# Tạo Đơn Thất Bại
source: Order Creation Failed
th: การสร้างคำสั่งซื้อล้มเหลว
zh_cn: 订单创建失败

source: Reload
th: โหลดซ้ำ
zh_cn: 重新加载

source: All
th: ทั้งหมด
zh_cn: 所有

source: Organization
th: องค์กร
zh_cn: 组织

# Tổng Lượng Tồn Hàng Hóa
source: Total goods inventory
th: สินค้าคงคลังรวม
zh_cn: 总商品库存

# Tổng Số Lượng Tồn Kho
source: Total Inventory Quantity
th: ปริมาณสินค้าคงคลังรวม
zh_cn: 总库存量

source: Start date
th: วันที่เริ่มต้น
zh_cn: 开始日期

source: Vietnamese
th: ภาษาเวียดนาม
zh_cn: 越南语

# Vui lòng chọn hiển thị danh sách vật tư theo tất cả.
source: Please choose to show property listings by all.
th: โปรดเลือกแสดงรายการคุณสมบัติทั้งหมด
zh_cn: 请选择显示所有物料列表。

# Vui Lòng Nhập Mã Phiếu Nhập
source: Please enter purchase order id
th: โปรดป้อนรหัสใบสั่งซื้อ
zh_cn: 请输入采购订单号

# Vui Lòng Nhập Mã Phiếu Xuất
source: Please Enter Sale Order Id !!!
th: โปรดป้อนรหัสใบสั่งขาย!!!
zh_cn: 请输入销售订单号！！！

# Vui Lòng Nhập Số Lượng Cao Nhất
source: Please Enter Maximum Quantity !!!
th: โปรดป้อนปริมาณสูงสุด!!!
zh_cn: 请输入最大数量！！！

# Vui Lòng Nhập Số Lượng Thấp Nhất
source: Please Enter Minimum Quantity !!!
th: โปรดป้อนปริมาณขั้นต่ำ!!!
zh_cn: 请输入最小数量！！！

# Vui Lòng Nhập Số Lượng Tồn
source: Please Enter Quantity Inventory !!!
th: โปรดป้อนปริมาณสินค้าคงคลัง!!!
zh_cn: 请输入库存数量！！！

# Vui Lòng Nhập Số Lượng Vào Kho
source: Please Enter Quantity In Warehouse !!!
th: โปรดป้อนปริมาณในคลังสินค้า!!!
zh_cn: 请输入入库数量！！！

# Vui Lòng Nhập Tên Kho Hàng
source: Please Enter Warehouse Name !!!
th: โปรดป้อนชื่อคลังสินค้า!!!
zh_cn: 请输入仓库名称！！！

# input_require_correctly
source: Please enter all data correctly to ensure the system
th: โปรดป้อนข้อมูลทั้งหมดให้ถูกต้องเพื่อให้แน่ใจว่าระบบ
zh_cn: 请正确输入所有数据以确保系统正常运行

# Vui Lòng Tìm Chọn Mã Hàng Hóa Để Lập Phiếu
source: Please Search the Goods Id to Create a Purchase Order
th: โปรดค้นหารหัสสินค้าเพื่อสร้างใบสั่งซื้อ
zh_cn: 请搜索商品ID以创建单据

# Vẫn Còn Dư
source: There are
th: มี
zh_cn: 还有

# Về Sản Phẩm
source: About the product
th: เกี่ยวกับผลิตภัณฑ์
zh_cn: 关于产品

# warehouse_detail_list
source: Warehouse Inventory Details
th: รายละเอียดสินค้าคงคลังของคลังสินค้า
zh_cn: 仓库库存详情

# Xuất File
source: Export
th: ส่งออก
zh_cn: 导出

source: From warehouse
th: จากคลังสินค้า
zh_cn: 从仓库出库

source: Delete
th: ลบ
zh_cn: 删除

source: Delete all Duplicate codes
th: ลบรหัสซ้ำทั้งหมด
zh_cn: 删除所有重复代码

# Đã gửi thành công
source: Sent Successfully
th: ส่งสำเร็จแล้ว
zh_cn: 发送成功

source: Checked
th: ตรวจสอบแล้ว
zh_cn: 已检查

# Đã nhận được EPC Thành Công
source: Successfully received EPC
th: ได้รับ EPC สำเร็จแล้ว
zh_cn: 成功接收 EPC

# Đã Nhập Đủ Số Lượng
source: Enough Quantity Entered !!!
th: ป้อนปริมาณเพียงพอแล้ว!!!
zh_cn: 已输入足够数量！！！

source: Scanned
th: สแกนแล้ว
zh_cn: 已扫描

# Đã Tồn Tại, Có Mã EPC Là
source: Already Exists, Has EPC Code Is
th: มีอยู่แล้ว มีรหัส EPC คือ
zh_cn: 已存在，EPC 代码为

source: Close
th: ปิด
zh_cn: 关闭

# Đăng Kí
source: Sign Up
th: ลงทะเบียน
zh_cn: 注册

# create_account
source: Register New Account
th: ลงทะเบียนบัญชีใหม่
zh_cn: 注册新账户

source: Login
th: เข้าสู่ระบบ
zh_cn: 登录

source: Login time
th: เวลาเข้าสู่ระบบ
zh_cn: 登录时间

source: Logout
th: ออกจากระบบ
zh_cn: 登出

source: Unit
th: หน่วย
zh_cn: 单位

source: Path
th: เส้นทาง
zh_cn: 路径

# Đặt Hàng Bán
source: Sales Order
th: ใบสั่งขาย
zh_cn: 销售订单

source: End date
th: วันที่สิ้นสุด
zh_cn: 结束日期

source: Address
th: ที่อยู่
zh_cn: 地址

source: Enough
th: พอ
zh_cn: 足够

# export_warehouse
source: Outbound Operations
th: การดำเนินการขาออก
zh_cn: 出库操作

# Not_Found_Title
source: The page you are looking for not available!
th: หน้าที่คุณกำลังค้นหาไม่มีให้บริการ!
zh_cn: 您要查找的页面不存在！

# Not_Found_Description
source: You will be redirected to Home page in 5 seconds...
th: คุณจะถูกเปลี่ยนเส้นทางไปยังหน้าแรกใน 5 วินาที...
zh_cn: 您将在10秒后重定向到主页...

# Back_Home
source: Go to Home
th: กลับสู่หน้าหลัก
zh_cn: 返回主页

# import_warehouse
source: Inbound Operations
th: การดำเนินการขาเข้า
zh_cn: 入库操作

# create_import_form
source: Create Goods Receipt
th: สร้างเอกสารการรับสินค้า
zh_cn: 创建入库请求

# scan_import_form
source: Scanning Goods Receipt
th: การสแกนการรับสินค้า
zh_cn: 扫描入库单

# scan_export_form
source: Scanning Goods Issue
th: การสแกนการออกสินค้า
zh_cn: 扫描出库单

# scan_stock_take_form
source: Inventory Tracking
th: การติดตามสินค้าคงคลัง
zh_cn: 库存盘点

source: Inventory
th: สินค้าคงคลัง
zh_cn: 库存

# good_group_catalog
source: Goods Group
th: กลุ่มสินค้า
zh_cn: 商品组

# goods_catalog
source: Goods
th: รายการสินค้า
zh_cn: 商品

# management_catalog
source: Management
th: การจัดการ
zh_cn: 管理

source: Customer Management
th: การจัดการลูกค้า
zh_cn: 客户管理

source: Authorization Management
th: การจัดการสิทธิ์
zh_cn: 权限管理

# update_system
source: Update Version
th: อัปเดตเวอร์ชัน
zh_cn: 更新版本

# update_catalog
source: Update
th: อัปเดต
zh_cn: 更新

source: Update Machine
th: อัปเดตเครื่อง
zh_cn: 更新扫描设备

source: Help Center
th: ศูนย์ช่วยเหลือ
zh_cn: 帮助中心

# good_finding_list
source: Searchable Product List
th: รายการสินค้าที่ค้นหาได้
zh_cn: 可搜索产品列表

# overall
source: Overview
th: ภาพรวม
zh_cn: 概览

source: Goods Management
th: การจัดการสินค้า
zh_cn: 商品管理

source: Units Management
th: การจัดการหน่วย
zh_cn: 单位管理

source: Scan status
th: สถานะการสแกน
zh_cn: 扫描状态

source: Approval status
th: สถานะการอนุมัติ
zh_cn: 审批状态

# not_approve
source: Not yet approved
th: ยังไม่ได้รับการอนุมัติ
zh_cn: 未批准

source: Approved
th: อนุมัติแล้ว
zh_cn: 已批准

source: Cancel
th: ยกเลิก
zh_cn: 取消

source: Scan detail
th: รายละเอียดการสแกน
zh_cn: 扫描详情

source: Approve
th: อนุมัติ
zh_cn: 批准

source: Transaction name
th: ชื่อธุรกรรม
zh_cn: 交易名称

source: Representative person
th: ผู้แทน
zh_cn: 代表人

source: Transaction account
th: บัญชีธุรกรรม
zh_cn: 交易账户

# good_group
source: Goods Group
th: กลุ่มสินค้า
zh_cn: 商品组

# min_debt
source: Minimum debt
th: หนี้ขั้นต่ำ
zh_cn: 最小债务

# max_debt
source: Maximun debt
th: หนี้สูงสุด
zh_cn: 最大债务

# detail_bussiness_customer
source: Detail Business customers
th: รายละเอียดลูกค้าธุรกิจ
zh_cn: 企业客户详情

source: Search by Name
th: ค้นหาตามชื่อ
zh_cn: 按名称搜索

source: Goods
th: สินค้า
zh_cn: 商品

source: RFID scan
th: การสแกน RFID
zh_cn: RFID 扫描处理

source: Tag registration
th: การลงทะเบียนแท็ก
zh_cn: 标签注册

source: Enter function name
th: ป้อนชื่อฟังก์ชัน
zh_cn: 输入函数名

source: Enter method
th: ป้อนวิธีกา
zh_cn: 输入方法

source: Successful status
th: สถานะสำเร็จ
zh_cn: 成功状态

source: Successful value
th: ค่าสถานะสำเร็จ
zh_cn: 成功状态值

source: Successful notification key
th: คีย์การแจ้งเตือนสำเร็จ
zh_cn: 成功通知关键字

source: Successful object
th: วัตถุที่ส่งคืน
zh_cn: 成功返回对象

source: Add parameter
th: เพิ่มพารามิเตอร์
zh_cn: 添加参数

source: Delete parameter
th: ลบพารามิเตอร์
zh_cn: 删除参数

source: Apply return value
th: ใช้ค่าคืน
zh_cn: 应用返回值

source: Enter API Hostname
th: ป้อนชื่อโฮสต์ API
zh_cn: 输入 API 主机名

# note_for_api_setup
source: Note: For API setup, please right-click on setup folder
th: หมายเหตุ: สำหรับการตั้งค่า API โปรดคลิกขวาที่โฟลเดอร์การตั้งค่า
zh_cn: 注意：要设置 API，请右键单击需要设置的文件夹

# goods_infor
source: Goods information
th: ข้อมูลสินค้า
zh_cn: 商品信息

source: Goods quantity
th: ปริมาณสินค้า
zh_cn: 商品数量

source: Confirm
th: ยืนยัน
zh_cn: 确认

# enter_good_infor
source: Enter good information
th: ป้อนข้อมูลสินค้า
zh_cn: 输入商品信息

source: Good import quantity
th: ปริมาณการนำเข้าสินค้า
zh_cn: 商品入库数量

# note_for_inventory_scanning
source: Perform warehouse scanning to count the quantity of goods being created (if any) to save inventory information
th: ทำการสแกนคลังสินค้าเพื่อนับปริมาณสินค้าที่กำลังสร้าง (ถ้ามี) เพื่อบันทึกข้อมูลสินค้าคงคลัง
zh_cn: 执行仓库扫描以清点正在创建的商品数量（如果有），以保存库存信息

source: Total scanned EPC
th: EPC ที่สแกนทั้งหมด
zh_cn: 已扫描EPC总数

source: Perform scanning
th: ทำการสแกน
zh_cn: 执行扫描

# scanned_epc_infor
source: Scanned EPC information
th: ข้อมูล EPC ที่สแกนได้
zh_cn: 已扫描的EPC信息

# epc_excess_or_wrong
source: EPC was excessed or wronged
th: EPC เกินหรือผิด
zh_cn: EPC 超出或错误

# confirm_goods_infor
source: Confirm goods information
th: ยืนยันข้อมูลสินค้า
zh_cn: 确认商品信息

# simple_infor
source: Simple information
th: ข้อมูลพื้นฐาน
zh_cn: 基本信息

source: Previous
th: ก่อนหน้า
zh_cn: 上一步

# create_new
source: New
th: ใหม่
zh_cn: 新建

source: Next
th: ถัดไป
zh_cn: 下一步

# good_detail
source: Goods detail
th: รายละเอียดสินค้า
zh_cn: 商品详情

# edit_good_infor
source: Edit goods information
th: แก้ไขข้อมูลสินค้า
zh_cn: 编辑商品信息

source: Update good quantity
th: อัปเดตปริมาณสินค้า
zh_cn: 更新商品数量

# present_inventory_infor
source: Present inventory information
th: ข้อมูลสินค้าคงคลังปัจจุบัน
zh_cn: 当前库存信息

source: Scanned quantity
th: ปริมาณที่สแกน
zh_cn: 实际扫描数量

source: Scanning data
th: ข้อมูลการสแกนสินค้า
zh_cn: 扫描数据

source: Total inventory
th: ปริมาณสต็อกรวม
zh_cn: 总库存量

source: Total scanned goods
th: สินค้าที่สแกนทั้งหมด
zh_cn: 已扫描商品总数

source: Scanned goods
th: สินค้าที่สแกน
zh_cn: 已扫描商品

source: List of items to find
th: รายการสิ่งของที่ต้องหา
zh_cn: 需要查找的物品列表

source: Check inventory in warehouses
th: ตรวจสอบสินค้าคงคลังในคลังสินค้า
zh_cn: 检查仓库库存量

source: Good group name
th: ชื่อกลุ่มสินค้า
zh_cn: 商品组名称

# login_welcome
source: Welcome to
th: ยินดีต้อนรับสู่
zh_cn: 欢迎来到

# enter_permission_info
source: Enter permission information
th: ป้อนข้อมูลสิทธิ์
zh_cn: 输入权限信息

source: Permission name
th: ชื่อสิทธิ์
zh_cn: 权限名称

source: Select functions for permission
th: เลือกฟังก์ชันสำหรับสิทธิ์
zh_cn: 为权限选择功能

# find_functions
source: Find function
th: ค้นหาฟังก์ชัน
zh_cn: 查找功能

# edit_permission_info
source: Edit permission information
th: แก้ไขข้อมูลสิทธิ์
zh_cn: 编辑权限信息

source: Permission list
th: รายการสิทธิ์
zh_cn: 权限列表

source: Add permission
th: เพิ่มสิทธิ์
zh_cn: 添加权限

source: Order ID
th: รหัสคำสั่งซื้อ
zh_cn: 订单ID

# import_from_warehouse
source: Import at warehouse
th: นำเข้าที่คลังสินค้า
zh_cn: 从仓库入库

source: Submit
th: ส่ง
zh_cn: 提交

source: Import form ID
th: รหัสแบบฟอร์มนำเข้า
zh_cn: 入库单号

source: Import warehouse ID
th: รหัสคลังสินค้านำเข้า
zh_cn: 入库请求单号

source: Retrieve data from File
th: ดึงข้อมูลจากไฟล์
zh_cn: 从文件检索数据

source: RFID scan data
th: ข้อมูลการสแกน RFID
zh_cn: RFID 扫描数据

source: Total
th: ทั้งหมด
zh_cn: 总计

source: Warehouse import data list
th: รายการข้อมูลการนำเข้าคลังสินค้า
zh_cn: 仓库入库数据列表

# scanning_form
source: Scanning record
th: บันทึกการสแกน
zh_cn: 扫描记录

source: Stock-take ID
th: รหัสการนับสต็อก
zh_cn: 盘点单ID

source: Account
th: บัญชี
zh_cn: 账户

source: Management permissions
th: สิทธิ์การจัดการ
zh_cn: 管理权限

source: Good catalog management
th: การจัดการแคตตาล็อกสินค้า
zh_cn: 商品目录管理

# account_catalog
source: Account
th: บัญชี
zh_cn: 账户目录

source: Delete warehouse
th: ลบคลังสินค้า
zh_cn: 删除仓库

# delete_good
source: Delete goods
th: ลบสินค้า
zh_cn: 删除商品

# delete_good_group
source: Delete goods group
th: ลบกลุ่มสินค้า
zh_cn: 删除商品组

# add_customer
source: Add new customer
th: เพิ่มลูกค้าใหม่
zh_cn: 添加新客户

source: Delete customer
th: ลบลูกค้า
zh_cn: 删除客户

# add_customer_type
source: Add new customer type
th: เพิ่มประเภทลูกค้าใหม่
zh_cn: 添加新客户类型

source: Edit customer type
th: แก้ไขประเภทลูกค้า
zh_cn: 编辑客户类型

source: Delete customer type
th: ลบประเภทลูกค้า
zh_cn: 删除客户类型

# add_user
source: Add new user
th: เพิ่มผู้ใช้ใหม่
zh_cn: 添加新用户

source: Edit user
th: แก้ไขผู้ใช้
zh_cn: 编辑用户

source: Edit user password
th: แก้ไขรหัสผ่านผู้ใช้
zh_cn: 编辑用户密码

source: Delete user
th: ลบผู้ใช้
zh_cn: 删除用户

source: Change password
th: เปลี่ยนรหัสผ่าน
zh_cn: 更改密码

source: Current password
th: รหัสผ่านปัจจุบัน
zh_cn: 当前密码

source: New password
th: รหัสผ่านใหม่
zh_cn: 新密码

source: Confirm new password
th: ยืนยันรหัสผ่านใหม่
zh_cn: 确认新密码

source: Edit account
th: แก้ไขบัญชี
zh_cn: 编辑账户

source: Permission
th: สิทธิ์
zh_cn: 权限

# update_account_info
source: Update account information
th: อัปเดตข้อมูลบัญชี
zh_cn: 更新账户信息

# user_fullname
source: Fullname
th: ชื่อเต็ม
zh_cn: 全名

source: Date of birth
th: วันเกิด
zh_cn: 出生日期

# update_account_permission
source: Update account permissions
th: อัปเดตสิทธิ์บัญชี
zh_cn: 更新账户权限

source: Select permission
th: เลือกสิทธิ์
zh_cn: 选择权限

source: Select function
th: เลือกฟังก์ชัน
zh_cn: 选择功能

source: Search function
th: ค้นหาฟังก์ชัน
zh_cn: 搜索功能

source: Register
th: ลงทะเบียน
zh_cn: 注册

# personal_info
source: Personal information
th: ข้อมูลส่วนตัว
zh_cn: 个人信息

# account_info
source: Account information
th: ข้อมูลบัญชี
zh_cn: 账户信息

source: Confirm password
th: ยืนยันรหัสผ่าน
zh_cn: 确认密码

# add_account
source: Add new account
th: เพิ่มบัญชีใหม่
zh_cn: 添加新账户

source: Export quantity
th: ปริมาณการส่งออก
zh_cn: 出库数量

source: Approve status
th: สถานะการอนุมัติ
zh_cn: 审批状态

source: Stock-take status
th: สถานะการนับสต็อก
zh_cn: 盘点单状态

source: Customer type name
th: ชื่อประเภทลูกค้า
zh_cn: 客户类型名称

# Chưa kiểm
source: Unchecked
th: ไม่ได้ตรวจสอบ
zh_cn: 未检查

# Đã kiểm
source: Checked
th: ตรวจสอบแล้ว!
zh_cn: 已检查！

# list_charts
source: List of request form chart
th: รายการแผนภูมิแบบฟอร์มคำขอ
zh_cn: 请求单图表列表

source: Inventory chart
th: แผนภูมิสินค้าคงคลัง
zh_cn: 库存图表

# rfid_reading
source: RFID Processing
th: การประมวลผล RFID
zh_cn: RFID 读取

source: Upload PreASN
th: อัปโหลด PreASN
zh_cn: 上传 PreASN 文件

source: HOD/Confirm
th: HOD/ยืนยัน
zh_cn: HOD/确认

# group_good_management
source: Goods Group Management
th: การจัดการกลุ่มสินค้า
zh_cn: 商品组管理

# total_quantity_wh
source: Total inventory quantity across warehouses
th: ปริมาณสินค้าคงคลังรวมในคลังสินค้า
zh_cn: 所有仓库的总库存量

# wh_noti
source: Warehouses
th: คลังสินค้า
zh_cn: 仓库

# import_noti
source: Goods receipts
th: การรับสินค้า
zh_cn: 入库单

# export_noti
source: Goods issues
th: การออกสินค้า
zh_cn: 出库单

# issues_review
source: Goods issue notes pending approval
th: ใบแจ้งการออกสินค้าที่รอดำเนินการอนุมัติ
zh_cn: 待审批的出库单

# receipt_review
source: Goods receipt notes pending approval
th: ใบรับสินค้าที่รอดำเนินการอนุมัติ
zh_cn: 待审批的收货单

# current_inventory_noti
source: Current inventory quantity of goods
th: ปริมาณสินค้าคงคลังปัจจุบันของสินค้า
zh_cn: 现有商品的当前库存量

# search_place_layout
source: Searching function
th: กำลังค้นหาฟังก์ชัน
zh_cn: 搜索功能

# import_export_chart
source: Quantity Inbound / Outbound chart
th: แผนภูมิปริมาณการนำเข้า/ส่งออก
zh_cn: 入库/出库数量图表

# top_3_product
source: Top 3 best-selling products
th: 3 อันดับสินค้าขายดีที่สุด
zh_cn: 前3名畅销产品

source: Outbound
th: ขาออก
zh_cn: 出库

# stock_take_chart
source: Stoke-take
th: การนับสต็อก
zh_cn: 盘点

# action
source: Actions
th: การกระทำ
zh_cn: 操作

# good_group_list_page
source: Goods group list
th: รายการกลุ่มสินค้า
zh_cn: 商品组列表

# upload_good_group
source: Add new goods group by uploading Excel file
th: เพิ่มกลุ่มสินค้าใหม่โดยการอัปโหลดไฟล์ Excel
zh_cn: 通过上传Excel文件添加新商品组

# good_group_search
source: Searching goods group by name
th: กำลังค้นหากลุ่มสินค้าตามชื่อ
zh_cn: 按名称搜索商品组

# print_time
source: Printing Date
th: วันที่พิมพ์
zh_cn: 打印日期

# account_print
source: Account's Name
th: ชื่อบัญชี
zh_cn: 打印人

# good_group_print
source: GOODS GROUP LIST
th: รายการกลุ่มสินค้า
zh_cn: 商品组列表

source: Printing
th: กำลังพิมพ์
zh_cn: 正在打印

# update_print_btn
source: Update print format
th: อัปเดตรูปแบบการพิมพ์
zh_cn: 更新打印格式

# good_group_warning
source: Are you sure you want to delete this goods group?
th: คุณแน่ใจหรือไม่ว่าต้องการลบกลุ่มสินค้านี้?
zh_cn: 您确定要删除此商品组吗？

# remove_unwanted
source: Unwanted data loss may happen!
th: อาจเกิดการสูญหายของข้อมูลที่ไม่ต้องการ!
zh_cn: 可能发生不必要的数据丢失！

# delete_success
source: Delete data successfully!!!
th: ลบข้อมูลสำเร็จแล้ว!!!
zh_cn: 数据删除成功！

# error_ajax
source: An error may occur, please try again later!
th: อาจเกิดข้อผิดพลาด โปรดลองอีกครั้งในภายหลัง!
zh_cn: 可能发生错误，请稍后重试！

# add_good_group_layout
source: Add New Goods Group
th: เพิ่มกลุ่มสินค้าใหม่
zh_cn: 添加新商品组

# good_group_line
source: Goods group's name in line
th: ชื่อกลุ่มสินค้าในบรรทัด
zh_cn: 商品组名称在行

# added_in_system
source: is already added into system
th: ถูกเพิ่มเข้าสู่ระบบแล้ว
zh_cn: 已添加到系统

# is_not_empty
source: cannot be empty
th: ไม่สามารถว่างได้
zh_cn: 不能为空

# duplicated_line
source: is duplicated with another line, please check again
th: ซ้ำกับบรรทัดอื่น โปรดตรวจสอบอีกครั้ง
zh_cn: 与另一行重复，请重新检查

# good_group_duplicated
source: Duplicated goods group's id
th: รหัสกลุ่มสินค้าซ้ำ
zh_cn: 商品组ID重复

# pdf
source: Export PDF successfully!!!
th: ส่งออก PDF สำเร็จแล้ว!!!
zh_cn: PDF 文件导出成功！

# csv
source: Export CSV successfully!!!
th: ส่งออก CSV สำเร็จแล้ว!!!
zh_cn: CSV 文件导出成功！

# excel
source: Export Excel successfully!!!
th: ส่งออก Excel สำเร็จแล้ว!!!
zh_cn: Excel 文件导出成功！

source: From date
th: ตั้งแต่วันที่
zh_cn: 从日期

source: To date
th: ถึงวันที่
zh_cn: 至日期

# upload_good
source: Add new goods by uploading Excel file
th: เพิ่มสินค้าใหม่โดยการอัปโหลดไฟล์ Excel
zh_cn: 通过上传Excel文件添加新商品

# good_search
source: Searching goods by name...
th: กำลังค้นหาสินค้าตามชื่อ...
zh_cn: 按名称搜索商品...

# good_print
source: GOODS LIST
th: รายการสินค้า
zh_cn: 商品列表

# good_edit
source: Edit
th: แก้ไข
zh_cn: 编辑

# good_delete
source: Delete
th: ลบสินค้า
zh_cn: 删除商品

# good_delete_warning
source: Are you sure you want to delete this product?
th: คุณแน่ใจหรือไม่ว่าต้องการลบผลิตภัณฑ์นี้?
zh_cn: 您确定要删除此产品吗？

# to_date_error
source: The end date must be later than the start date!
th: วันที่สิ้นสุดต้องหลังจากวันที่เริ่มต้น!
zh_cn: 结束日期必须晚于开始日期！

# from_date_error
source: The start date must be earlier than the end date!
th: วันที่เริ่มต้นต้องเร็วกว่าวันที่สิ้นสุด!
zh_cn: 开始日期必须早于结束日期！

# good_note
source: Enter a note for this...
th: ป้อนบันทึกสำหรับสิ่งนี้...
zh_cn: 输入产品备注...

# good_list_title
source: Goods list
th: รายการสินค้า
zh_cn: 商品列表

# choose_file_error
source: Please choose a file!!!
th: โปรดเลือกไฟล์!!!
zh_cn: 请选择文件！

# excel_miss
source: Please choose only Excel file!
th: โปรดเลือกเฉพาะไฟล์ Excel!
zh_cn: 请只选择 Excel 文件！

# not_in_system
source: is not in system!
th: ไม่มีอยู่ในระบบ!
zh_cn: 不在系统中！

# unit_line
source: Unit's name in line
th: ชื่อหน่วยในบรรทัด
zh_cn: 单位名称在行

# different_line
source: is different from line
th: แตกต่างจากบรรทัด
zh_cn: 与行不同

# goods_line
source: Goods name in line
th: ชื่อสินค้าในบรรทัด
zh_cn: 商品名称在行

# upload_success
source: Upload file successfully!!!
th: อัปโหลดไฟล์สำเร็จแล้ว!!!
zh_cn: 文件上传成功！

# goods_exist
source: The goods code is already exist.
th: รหัสสินค้ามีอยู่แล้ว
zh_cn: 商品代码已存在。

# goods_invalid
source: The goods code is invalid
th: รหัสสินค้าไม่ถูกต้อง
zh_cn: 商品代码无效

# add_goods_page
source: Add new goods
th: เพิ่มสินค้าใหม่
zh_cn: 添加新商品

# goods_id_add_placeholder
source: Enter new goods id...
th: ป้อนรหัสสินค้าใหม่...
zh_cn: 输入新商品ID...

# goods_name_add_placeholder
source: Enter new goods name...
th: ป้อนชื่อสินค้าใหม่...
zh_cn: 输入新商品名称...

source: Goods ID
th: รหัสสินค้า
zh_cn: 商品ID

# detail
source: More detail
th: รายละเอียดเพิ่มเติม
zh_cn: 更多详情

# good_id_search
source: Searching goods by id...
th: กำลังค้นหาสินค้าตามรหัส...
zh_cn: 按ID搜索商品...

# goods_epc_detail
source: More EPC detail
th: รายละเอียด EPC เพิ่มเติม
zh_cn: 更多EPC详情

# goods_detail_page
source: Detailed goods list
th: รายการสินค้ารายละเอียด
zh_cn: 商品明细列表

# unit_list_page
source: Unit list
th: รายการหน่วย
zh_cn: 单位列表

# upload_unit
source: Add new unit by uploading Excel file
th: เพิ่มหน่วยใหม่โดยการอัปโหลดไฟล์ Excel
zh_cn: 通过上传Excel文件添加新单位

# unit_search
source: Searching unit by name...
th: กำลังค้นหาหน่วยตามชื่อ...
zh_cn: 按名称搜索单位...

# unit_print
source: UNIT LIST
th: รายการหน่วย
zh_cn: 单位列表

source: Unit name
th: ชื่อหน่วย
zh_cn: 单位名称

# total_print
source: Total
th: ทั้งหมด
zh_cn: 总计

# unit_edit
source: Edit
th: แก้ไข
zh_cn: 编辑

# unit_delete
source: Delete
th: ลบ
zh_cn: 删除

# unit_delete_warning
source: Are you sure you want to delete this unit?
th: คุณแน่ใจหรือไม่ว่าต้องการลบหน่วยนี้?
zh_cn: 您确定要删除此单位吗？

# unit_add_page
source: Add new unit
th: เพิ่มหน่วยใหม่
zh_cn: 添加新单位

# unit_duplicated
source: Duplicated unit id!
th: รหัสหน่วยซ้ำ!
zh_cn: 单位ID重复！

# warehouse_upload
source: Add new warehouse by uploading Excel file
th: เพิ่มคลังสินค้าใหม่โดยการอัปโหลดไฟล์ Excel
zh_cn: 通过上传Excel文件添加新仓库

# warehouse_search
source: Searching warehouse by name...
th: กำลังค้นหาคลังสินค้าตามชื่อ...
zh_cn: 按名称搜索仓库...

# warehouse_print
source: WAREHOUSE LIST
th: รายการคลังสินค้า
zh_cn: 仓库列表

# warehouse_min
source: The lowest stock quantity
th: ปริมาณสต็อกต่ำสุด
zh_cn: 最低库存量

# warehouse_max
source: The highest stock quantity
th: ปริมาณสต็อกสูงสุด
zh_cn: 最高库存量

# warehouse_edit
source: Edit
th: แก้ไข
zh_cn: 编辑

# warehouse_delete
source: Delete
th: ลบ
zh_cn: 删除

# warehouse_delete_warning
source: Are you sure you want to delete this warehouse?
th: คุณแน่ใจหรือไม่ว่าต้องการลบคลังสินค้านี้?
zh_cn: 您确定要删除此仓库吗？

# warehouse_list_page
source: Warehouse list
th: รายการคลังสินค้า
zh_cn: 仓库列表

# warehouse_add_page
source: Add new warehouse
th: เพิ่มคลังสินค้าใหม่
zh_cn: 添加新仓库

# warehouse_line
source: Warehouse's name in line
th: ชื่อคลังสินค้าในบรรทัด
zh_cn: 仓库名称在行

# warehouse_min_upload
source: The lowest inventory quantity in line
th: ปริมาณสินค้าคงคลังต่ำสุดในบรรทัด
zh_cn: 行中最低库存量

# warehouse_min_max_upload
source: cannot be larger than the highest inventory quantity
th: ต้องไม่มากกว่าปริมาณสินค้าคงคลังสูงสุด
zh_cn: 不能大于最高库存量

# warehouse_max_upload
source: The highest inventory quantity in line
th: ปริมาณสินค้าคงคลังสูงสุดในบรรทัด
zh_cn: 行中最高库存量

# warehouse_max_min_upload
source: cannot be smaller than the lowest inventory quantity
th: ต้องไม่น้อยกว่าปริมาณสินค้าคงคลังต่ำสุด
zh_cn: 不能小于最小库存量

# warehouse_duplicated_upload
source: Duplicated warehouse id!
th: รหัสคลังสินค้าซ้ำ!
zh_cn: 仓库ID重复！

# warehouse_error_id
source: Unvalided warehouse id!
th: รหัสคลังสินค้าไม่ถูกต้อง!
zh_cn: 仓库ID无效！

# warehouse_error_unknown
source: Warehouse isn't exist!
th: คลังสินค้าไม่มีอยู่!
zh_cn: 仓库不存在！

# warehouse_fw_req_err
source: Unvalied data requested!
th: ข้อมูลที่ร้องขอไม่ถูกต้อง!
zh_cn: 请求数据无效！
