Repository: NhatDo2002/WMS_Application
Catalog: iGMS/App_GlobalResources/Resource.*.resx
Languages: th, zh_cn

# stock_not_exist
source: The inventory check code does not exist!
th: ไม่พบรหัสใบตรวจนับสินค้า!
zh_cn: 盘点单号不存在！

# enter_product_code
source: Please enter the product code
th: กรุณากรอกรหัสสินค้า
zh_cn: 请输入产品代码

# enter_product_name
source: Vui lòng điền tên hàng hóa
th: กรุณากรอกชื่อสินค้า
zh_cn: 请输入产品名称

# print_barcode_module
source: Print barcode
th: พิมพ์บาร์โค้ด
zh_cn: 打印条码

# scanned_record_code
source: Search scanned record code
th: ค้นหารหัสสแกน
zh_cn: 搜索扫描记录代码

# import_detail
source: Inbound form details
th: รายละเอียดใบรับสินค้า
zh_cn: 入库单详情

# not_all_assign_location
source: Some items have not been assigned a location. Please ensure all items have a complete location selected!
th: ยังมีรายการสินค้าที่ไม่ได้ระบุตำแหน่ง กรุณาเลือกตำแหน่งให้ครบถ้วนสำหรับทุกรายการ!
zh_cn: 还有未选择位置的商品。请为所有商品选择完整的位置！

# export_detail
source: Outbound Order Details
th: รายละเอียดใบส่งสินค้า
zh_cn: 出库单详情

# number_print_label
source: Quantity of printed labels
th: จำนวนฉลากที่พิมพ์
zh_cn: 打印标签数量

# print_function
source: Print labels for goods
th: พิมพ์ฉลากสินค้า
zh_cn: 打印商品标签

# select_print_type
source: Select connection type
th: เลือกประเภทการเชื่อมต่อ
zh_cn: 选择连接类型

source: Select printer
th: เลือกเครื่องพิมพ์
zh_cn: 选择打印机

# print_in_network
source: Network
th: เครือข่าย
zh_cn: 网络

# refesh_printer
source: Reload printer list
th: โหลดรายการเครื่องพิมพ์ใหม่
zh_cn: 重新加载打印机列表

# start_print
source: Perform printing
th: ดำเนินการพิมพ์
zh_cn: 执行打印

# please_select_printer
source: Please select a printer
th: กรุณาเลือกเครื่องพิมพ์!
zh_cn: 请选择打印机！

# print_success
source: Print successful!
th: พิมพ์สำเร็จ!
zh_cn: 打印成功!

# printer_paused
source: Cannot print because the printer is paused!
th: ไม่สามารถพิมพ์ได้เนื่องจากเครื่องพิมพ์หยุดชั่วคราว!
zh_cn: 无法打印，因为打印机已暂停！

# printer_open
source: Cannot print because the printer head is open!
th: ไม่สามารถพิมพ์ได้เนื่องจากหัวพิมพ์เปิดอยู่!
zh_cn: 无法打印，因为打印头已打开！

# printer_paper_out
source: Cannot print because the paper is out!
th: ไม่สามารถพิมพ์ได้เนื่องจากกระดาษหมด!
zh_cn: 无法打印，因为缺纸！

# printer_not_ready
source: The printer is not ready to print!
th: เครื่องพิมพ์ไม่พร้อมพิมพ์!
zh_cn: 打印机尚未准备就绪！

# printer_not_connect
source: Cannot connected to the printer!
th: ไม่สามารถเชื่อมต่อกับเครื่องพิมพ์ได้!
zh_cn: 无法连接到打印机！

source: Chinese
th: ภาษาจีน
zh_cn: 中文

source: Sample Text
th: ข้อความตัวอย่าง
zh_cn: 示例文本

# adjust_parameter
source: Adjust Parameters
th: ปรับพารามิเตอร์
zh_cn: 调整参数

source: Size
th: ขนาด
zh_cn: 尺寸

source: Font Size
th: ขนาดตัวอักษร
zh_cn: 字体大小

source: Display Text
th: แสดงข้อความ
zh_cn: 显示文本

source: Rotation Angle
th: มุมการหมุน
zh_cn: 旋转角度

# bar_witdh
source: Bar Width
th: ความกว้างของแท่ง
zh_cn: 条宽

source: Height
th: ความสูง
zh_cn: 高度

source: Yes
th: ใช่
zh_cn: 是

source: No
th: ไม่ใช่
zh_cn: 否

# update_label
source: Update Label Size
th: อัปเดตขนาดฉลาก
zh_cn: 更新标签尺寸

source: Width (inch)
th: ความกว้าง (นิ้ว)
zh_cn: 宽度（英寸）

source: Height (inch)
th: ความสูง (นิ้ว)
zh_cn: 高度（英寸）

source: Content
th: เนื้อหา
zh_cn: 内容

# label_review
source: Preview Label
th: ดูตัวอย่างฉลาก
zh_cn: 预览标签

source: Text
th: ข้อความ
zh_cn: 文本

source: QR Code
th: คิวอาร์โค้ด
zh_cn: 二维码

source: Barcode
th: บาร์โค้ด
zh_cn: 条形码

# select_printer_test_print
source: Select Printer for Test Print
th: เลือกเครื่องพิมพ์เพื่อทดลองพิมพ์
zh_cn: 选择打印机进行测试打印

source: Test Print
th: พิมพ์ทดสอบ
zh_cn: 测试打印

source: Save Layout
th: บันทึกเลย์เอาต์
zh_cn: 保存布局

source: Components
th: องค์ประกอบ
zh_cn: 组件

# design_label
source: Design Label Template
th: ออกแบบแม่แบบฉลาก
zh_cn: 设计标签模板

# no_printer_found
source: No printer available
th: ไม่มีเครื่องพิมพ์
zh_cn: 没有可用的打印机

# save_layout_successfully
source: Layout saved successfully
th: บันทึกเลย์เอาต์เรียบร้อยแล้ว
zh_cn: 布局保存成功

source: Barcode Structure Analysis
th: การวิเคราะห์โครงสร้างบาร์โค้ด
zh_cn: 条码结构分析

source: Field Segmentation
th: การแบ่งส่วนข้อมูล
zh_cn: 字段分段

source: Delimiter Detection
th: การตรวจจับตัวคั่น
zh_cn: 分隔符检测

source: Data Pattern Recognition
th: การจดจำรูปแบบข้อมูล
zh_cn: 数据模式识别

source: Setup Barcode Structure
th: การตั้งค่าโครงสร้างบาร์โค้ด
zh_cn: 设置条码结构

source: Content type
th: ประเภทเนื้อหา
zh_cn: 内容类型

source: Enter content manually
th: กรอกเนื้อหาด้วยตนเอง
zh_cn: 手动输入内容

source: Automatically fetch from PO
th: 从采购订单自动获取
zh_cn: ดึงจากใบสั่งซื้อโดยอัตโนมัติ

source: Select data field
th: เลือกฟิลด์ข้อมูล
zh_cn: 选择数据字段

source: Item code
th: รหัสสินค้า
zh_cn: 商品编码

source: Item name
th: ชื่อสินค้า
zh_cn: 商品名称

source: Preview
th: แสดงตัวอย่าง
zh_cn: 预览

# please_enter_delimiter
source: Please enter the delimiter character!
th: กรุณาใส่อักขระตัวคั่น!
zh_cn: 请输入分隔符字符!

source: Inventory Overview
th: ภาพรวมสต็อกสินค้า
zh_cn: 库存概览

source: Goods Data
th: ข้อมูลสินค้า
zh_cn: 商品数据

# warehouses_data
source: Warehouse Data
th: ข้อมูลคลังสินค้า
zh_cn: 仓库数据

source: Unit Data
th: ข้อมูลหน่วย
zh_cn: 单位数据

# groupgoods_data
source: Goods Group Data
th: ข้อมูลกลุ่มสินค้า
zh_cn: 商品分类数据

source: User
th: ผู้ใช้
zh_cn: 用户

source: Account Data
th: ข้อมูลบัญชี
zh_cn: 账户数据

# lock_account_admin
source: Your account has been locked. Please contact the administrator to unlock it!!!
th: บัญชีของคุณถูกล็อก โปรดติดต่อผู้ดูแลระบบเพื่อปลดล็อก!!!
zh_cn: 您的账户已被锁定，请联系管理员解锁！

# login_success
source: Login successful
th: เข้าสู่ระบบสำเร็จ
zh_cn: 登录成功

source: Processing...
th: กำลังประมวลผล...
zh_cn: 正在处理...

source: No data
th: ไม่มีข้อมูล
zh_cn: 没有数据

source: Showing
th: แสดง
zh_cn: 显示第

source: of
th: จากทั้งหมด
zh_cn: 条，共

# item_product_template
source: Item Group Template
th: แบบฟอร์มกลุ่มสินค้า
zh_cn: 商品组模板

# enter_product_code_excel
source: Enter product code
th: ป้อนรหัสสินค้า
zh_cn: 输入商品编码

# enter_product_description_excel
source: Enter product description
th: ป้อนคำอธิบายสินค้า
zh_cn: 输入商品描述

# sample_download_success
source: Sample file downloaded successfully
th: ดาวน์โหลดไฟล์ตัวอย่างสำเร็จ
zh_cn: 示例文件下载成功

source: Unit template
th: แม่แบบหน่วย
zh_cn: 单位模板

# unit_name_template
source: Enter unit name
th: ป้อนชื่อหน่วย
zh_cn: 输入单位名称

# unit_description
source: Enter unit description
th: ป้อนคำอธิบายหน่วย
zh_cn: 输入单位描述

# delete_goodsgrp_already_use
source: This product group name is currently used by some items. Are you sure you want to delete this information?
th: ชื่อกลุ่มสินค้านี้ถูกใช้กับสินค้าบางรายการ คุณแน่ใจหรือไม่ว่าต้องการลบข้อมูลนี้?
zh_cn: 此商品分类名称当前正在被某些商品使用，您确定要删除此信息吗?

# delete_unit_already_use
source: This unit name is currently used by some items. Are you sure you want to delete this information?
th: ชื่อหน่วยนี้ถูกใช้กับสินค้าบางรายการ คุณแน่ใจหรือไม่ว่าต้องการลบข้อมูลนี้?
zh_cn: 此单位名称当前正在被某些商品使用，您确定要删除此信息吗?

source: Warehouse template
th: แม่แบบคลังสินค้า
zh_cn: 仓库模板

# enter_wh_excel
source: Enter warehouse name
th: ป้อนชื่อคลังสินค้า
zh_cn: 输入仓库名称

# enter_minimum_qty_excel
source: Enter minimum quantity
th: ป้อนจำนวนต่ำสุด
zh_cn: 输入最小数量

# enter_maximum_qty_excel
source: Enter maximum quantity
th: ป้อนจำนวนสูงสุด
zh_cn: 输入最大数量

# enter_wh_des
source: Enter warehouse description
th: ป้อนคำอธิบายคลังสินค้า
zh_cn: 输入仓库描述

# not_valid_number
source: is not a valid number
th: ไม่ใช่ตัวเลขที่ถูกต้อง
zh_cn: 不是有效的数字

# minimum_stock_at_row
source: Minimum stock quantity at the row
th: ปริมาณสต็อกต่ำสุดในแถว
zh_cn: 行中的最小库存数量

# maximum_stock_at_row
source: Maximum stock quantity at the row
th: ปริมาณสต็อกสูงสุดในแถว
zh_cn: 行中的最大库存数量

# min_more_than_max
source: The minimum stock quantity cannot be greater than the maximum stock quantity
th: ปริมาณสต็อกต่ำสุดต้องไม่มากกว่าปริมาณสต็อกสูงสุด
zh_cn: 最小库存数量不能大于最大库存数量

# wh_already_contains_goods
source: This warehouse already contains detailed information about product quantities and cannot be deleted to ensure system data integrity
th: ขณะนี้คลังสินค้านี้มีข้อมูลรายละเอียดเกี่ยวกับปริมาณสินค้าอยู่แล้ว ไม่สามารถลบได้เพื่อความสมบูรณ์ของข้อมูลระบบ
zh_cn: 当前该仓库已包含有关商品数量的详细信息，为确保系统数据完整性，无法删除

source: Production Date
th: วันที่ผลิต
zh_cn: 生产日期

# enter_product_name_excel
source: Enter product name
th: ป้อนชื่อสินค้า
zh_cn: 输入商品名称

# enter_product_quantity_excel
source: Enter quantity
th: ป้อนจำนวน
zh_cn: 输入数量

# enter_product_group_excel
source: Enter product group (if any)
th: ป้อนกลุ่มสินค้า (ถ้ามี)
zh_cn: 输入商品分类（如有）

# enter_unit_excel
source: Enter unit (if any)
th: ป้อนหน่วย (ถ้ามี)
zh_cn: 输入单位（如有）

# enter_production_date_excel
source: Enter production date
th: ป้อนวันที่ผลิต
zh_cn: 输入生产日期

# enter_notes_excel
source: Enter notes (if any)
th: ป้อนหมายเหตุ (ถ้ามี)
zh_cn: 输入备注（如有）

source: Product template
th: แม่แบบสินค้า
zh_cn: 商品模板

# goodgroup_line
source: Item group name at row
th: ชื่อกลุ่มสินค้าในแถวนี้
zh_cn: 该行的商品组名称

# goods_id_line
source: Item code at row
th: รหัสสินค้าในแถวนี้
zh_cn: 该行的商品编码

# goods_quantity_line
source: Quantity at row
th: จำนวนในแถวนี้
zh_cn: 该行的数量

# already_exists
source: already exists in the system
th: มีอยู่ในระบบแล้ว
zh_cn: 已存在于系统中

source: in sheet
th: ในแผ่นงาน
zh_cn: 在工作表

# product_code_standard
source: The product code must not contain special characters or spaces between characters
th: รหัสสินค้าไม่สามารถมีอักขระพิเศษหรือเว้นวรรคระหว่างตัวอักษรได้
zh_cn: 商品编码不得包含特殊字符或字符之间的空格

# new_message
source: You have a new notification
th: คุณมีการแจ้งเตือนใหม่
zh_cn: 您有一條新通知

source: Invalid document code
th: รหัสเอกสารไม่ถูกต้อง
zh_cn: 无效的单据编号

source: Permission updated successfully!
th: แก้ไขสิทธิ์เรียบร้อยแล้ว!
zh_cn: 权限修改成功!

source: Permission added successfully!
th: เพิ่มสิทธิ์เรียบร้อยแล้ว!
zh_cn: 权限添加成功!

# delete_cus_relate_po_so
source: This customer has data associated with previous import or export vouchers. Are you sure you want to delete the data?
th: ลูกค้ารายนี้มีข้อมูลที่เกี่ยวข้องกับใบรับหรือใบส่งของก่อนหน้านี้ คุณแน่ใจหรือไม่ว่าต้องการลบข้อมูลนี้?
zh_cn: 该客户存在与之前的入库或出库单相关的数据。您确定要删除这些数据吗？

# delete_typecus_relate_cus
source: This customer type is currently being used in customer data. Are you sure you want to delete it?
th: ประเภทลูกค้านี้กำลังถูกใช้งานในข้อมูลลูกค้า คุณแน่ใจหรือไม่ว่าต้องการลบ?
zh_cn: 此客户类型正在被客户数据使用，您确定要删除吗？

# not_empty_po_id
source: The receipt code must not be empty
th: รหัสใบรับสินค้าห้ามเว้นว่าง
zh_cn: 入库单号不能为空

# invalid_receipt_id
source: Invalid receipt code
th: รหัสใบรับสินค้าไม่ถูกต้อง
zh_cn: 入库单号无效

# not_empty_so_id
source: The delivery code must not be empty
th: รหัสใบส่งของห้ามเว้นว่าง
zh_cn: 出库单号不能为空

# invalid_so_id
source: Invalid delivery code
th: รหัสใบส่งของไม่ถูกต้อง
zh_cn: 出库单号无效

# include_invalid_char
source: Includes invalid characters
th: มีอักขระไม่ถูกต้อง
zh_cn: 包含无效字符

# layout_label_not_exist
source: Layout of label is not exists in system. Please check again
th: รูปแบบฉลากไม่พบในระบบ กรุณาตรวจสอบอีกครั้ง
zh_cn: 系统中不存在标签布局。请重新检查

# cannot_connect_printer
source: Cannot connect to the printer, please check again
th: ไม่สามารถเชื่อมต่อกับเครื่องพิมพ์ได้ กรุณาตรวจสอบอีกครั้ง
zh_cn: 无法连接到打印机，请重新检查

# invalid_quantity_print
source: The print quantity of some items is incorrect
th: ปริมาณการพิมพ์ของสินค้าบางรายการไม่ถูกต้อง
zh_cn: 部分商品的打印数量不正确

# no_components
source: No components available for test print
th: ไม่มีองค์ประกอบใดสำหรับการพิมพ์ทดสอบ
zh_cn: 没有可用于测试打印的组件

# printer_connect_error
source: Printer connection error
th: ข้อผิดพลาดในการเชื่อมต่อเครื่องพิมพ์
zh_cn: 打印机连接错误

# excel_not_correct_format
source: The Excel file format does not match the required template
th: ไฟล์ Excel มีรูปแบบไม่ตรงตามแม่แบบที่กำหนด
zh_cn: Excel 文件格式不符合要求的模板

# name_not_contain_symtax
source: Must not contain numbers or special characters
th: ต้องไม่มีตัวเลขหรืออักขระพิเศษ
zh_cn: 不允许包含数字或特殊字符

source: Invalid phone number
th: หมายเลขโทรศัพท์ไม่ถูกต้อง
zh_cn: 无效的电话号码

# enter_new_pass
source: Please enter a new password
th: กรุณากรอกรหัสผ่านใหม่
zh_cn: 请输入新密码

# enter_renew_pass
source: Please enter the password confirmation!
th: กรุณากรอกยืนยันรหัสผ่าน!
zh_cn: 请输入确认密码！

# enter_current_pass
source: Enter current password
th: ป้อนรหัสผ่านปัจจุบัน
zh_cn: 输入当前密码

# inventory_code_already_exists
source: The inventory check code already exists
th: รหัสการตรวจนับสินค้ามีอยู่แล้ว
zh_cn: 库存盘点单号已存在

# manage_printer
source: Manage Printers
th: จัดการเครื่องพิมพ์
zh_cn: 管理打印机

# list_printer
source: Printer List
th: รายการเครื่องพิมพ์
zh_cn: 打印机列表

source: Edit Printer
th: แก้ไขเครื่องพิมพ์
zh_cn: 编辑打印机

source: Delete Printer
th: ลบเครื่องพิมพ์
zh_cn: 删除打印机

source: Printer Name
th: ชื่อเครื่องพิมพ์
zh_cn: 打印机名称

# ip
source: Network Address (IP)
th: ที่อยู่เครือข่าย (IP)
zh_cn: 网络地址 (IP)

source: Port
th: พอร์ต
zh_cn: 端口

# printer_not_exist
source: Printer data does not exist in the system
th: ไม่มีข้อมูลเครื่องพิมพ์ในระบบ
zh_cn: 系统中不存在打印机数据

# ip_invalid
source: Invalid network address format
th: รูปแบบที่อยู่เครือข่ายไม่ถูกต้อง
zh_cn: 网络地址格式无效

# port_invalid
source: Invalid port format
th: รูปแบบพอร์ตไม่ถูกต้อง
zh_cn: 端口格式无效

source: Add Printer
th: เพิ่มเครื่องพิมพ์
zh_cn: 添加打印机

source: Printer Information
th: ข้อมูลเครื่องพิมพ์
zh_cn: 打印机信息

# cannot_get_list_printer
source: Cannot retrieve the printer list
th: ไม่สามารถดึงรายการเครื่องพิมพ์ได้
zh_cn: 无法获取打印机列表

source: No printer address
th: ไม่มีที่อยู่เครื่องพิมพ์
zh_cn: 没有打印机地址

source: Manage Printers & Labels
th: จัดการเครื่องพิมพ์และฉลาก
zh_cn: 管理打印机和标签

# invalid_size_label
source: Invalid label size
th: ขนาดฉลากไม่ถูกต้อง
zh_cn: 标签尺寸无效

# structure_not_exist
source: Structure of barcode is not exists in system. Please check again
th: โครงสร้างบาร์โค้ดไม่มีอยู่ในระบบ กรุณาตรวจสอบอีกครั้ง
zh_cn: 条码结构在系统中不存在，请重新检查

# invalid_seperate_char
source: The separator character should only be certain special characters; avoid using letters or numbers.
th: อักขระตัวคั่นควรเป็นเพียงอักขระพิเศษบางตัวเท่านั้น หลีกเลี่ยงการใช้ตัวอักษรหรือตัวเลข
zh_cn: 分隔符应仅为某些特殊字符，避免使用字母或数字

# should_use_char
source: Special characters such as |, /, -... are recommended
th: ควรใช้อักขระพิเศษ เช่น |, /, -...
zh_cn: 建议使用特殊字符，如 |、/、-...

source: Type
th: พิมพ์
zh_cn: 类型
