Repository: NhatDo2002/WMS_Application
Catalog: iGMS/App_GlobalResources/Resource.*.resx
Languages: th, zh_cn

source: Account Create
th: สร้างบัญชี
zh_cn: 创建账户

source: Account List
th: รายการบัญชี
zh_cn: 账户列表

source: Add function
th: เพิ่มฟังก์ชัน
zh_cn: 添加功能

# add_goods
source: Add New Goods
th: เพิ่มสินค้าใหม่
zh_cn: 添加新商品

# add_good_group
source: Add new goods group
th: เพิ่มกลุ่มสินค้าใหม่
zh_cn: 添加新商品组

source: Add Type Customer
th: เพิ่มประเภทลูกค้า
zh_cn: 添加客户类型

# add_warehouses
source: Add New Warehouse
th: เพิ่มคลังสินค้าใหม่
zh_cn: 添加新仓库

source: at line
th: ที่บรรทัด
zh_cn: 在行

source: Start RFID scanning
th: เริ่มการสแกน RFID
zh_cn: 开始 RFID 扫描

source: Turn on Sound
th: เปิดเสียง
zh_cn: 打开声音

source: Start locating tags
th: เริ่มการระบุตำแหน่งแท็ก
zh_cn: 开始定位标签

# Bỏ Qua
source: Skip
th: ข้าม
zh_cn: 跳过

# CancelInfo
source: Cancel
th: ยกเลิก
zh_cn: 取消

# Chi Tiết
source: Details
th: รายละเอียด
zh_cn: 详情

# Chi Tiết Hàng Hóa
source: Goods Details
th: รายละเอียดสินค้า
zh_cn: 商品详情

# Chi Tiết Hàng Hóa Trong Kho
source: Details of Goods in Stock
th: รายละเอียดสินค้าในสต็อก
zh_cn: 库存商品详情

source: Warehouse detail
th: รายละเอียดคลังสินค้า
zh_cn: 仓库详情

# Chi Tiết Phiếu Kiểm Kê
source: Detail of Stock Take
th: รายละเอียดการนับสต็อก
zh_cn: 盘点单详情

source: Import form detail
th: รายละเอียดแบบฟอร์มนำเข้า
zh_cn: 入库单详情

# Chi Tiết Phiếu Xuất
source: Goods Issue Detail
th: รายละเอียดการออกสินค้า
zh_cn: 发货单详情

# Chi Tiết Vật Tư
source: Asset Detail
th: รายละเอียดสินทรัพย์
zh_cn: 物料详情

# hi_user
source: Hi,
th: สวัสดี,
zh_cn: 你好,

source: No good selected
th: ไม่ได้เลือกสินค้า
zh_cn: 未选择商品

# Chưa Có EPC
source: Not EPC
th: ยังไม่มี EPC
zh_cn: 无 EPC

# Chưa Có Mã Hàng
source: No Product Code yet
th: ยังไม่มีรหัสผลิตภัณฑ์
zh_cn: 无产品代码

# Chưa Có Tài Khoản
source: Do You Not Have an Account ?
th: คุณยังไม่มีบัญชีใช่หรือไม่?
zh_cn: 您还没有账户吗？

# uncheked
source: Unchecked
th: ไม่ได้ตรวจสอบ
zh_cn: 未检查

source: Quantity not entered for scanning
th: ยังไม่ได้ป้อนปริมาณสำหรับการสแกน
zh_cn: 未输入扫描数量

source: Not scanned yet
th: ยังไม่ได้สแกน
zh_cn: 未扫描

source: Not completed scanning
th: สแกนยังไม่เสร็จ
zh_cn: 未完成扫描

source: Choose file
th: เลือกไฟล์
zh_cn: 选择文件

# Chọn Hàng Hóa
source: Choose Goods
th: เลือกสินค้า
zh_cn: 选择商品

source: Select warehouses
th: เลือกคลังสินค้า
zh_cn: 选择仓库

# Chọn Kho Hàng Để Tiếp Tục
source: Select warehouse to continue!
th: เลือกคลังสินค้าเพื่อดำเนินการต่อ!
zh_cn: 请选择仓库以继续！

source: Select customers
th: เลือกลูกค้า
zh_cn: 选择客户

# Chọn Khách Hàng Để Tiếp Tục
source: Select Customer To Continue
th: เลือกผู้ซื้อเพื่อดำเนินการต่อ
zh_cn: 选择客户以继续

# Chọn Mã TK Hạch Toán
source: Select Accounting Account Code
th: เลือกรหัสบัญชีทางการบัญชี
zh_cn: 选择会计科目代码

# Chọn Nguồn KH
source: Select Customer Source
th: เลือกแหล่งที่มาของลูกค้า
zh_cn: 选择客户来源

# Chọn Ngành Nghề
source: Choose A Career
th: เลือกอาชีพ
zh_cn: 选择行业

# Chọn Nhân Viên Kiểm Hàng
source: Select goods inspection staff
th: เลือกพนักงานตรวจสอบสินค้า
zh_cn: 选择验货员

# Chọn NV Phụ Trách
source: Select Staff in Charge
th: เลือกพนักงานที่รับผิดชอบ
zh_cn: 选择负责人

# Chọn Phương Thức TT
source: Select Payment Method
th: เลือกวิธีการชำระเงิน
zh_cn: 选择付款方式

# Chọn Thẻ Thành Viên
source: Select Membership Card
th: เลือกบัตรสมาชิก
zh_cn: 选择会员卡

source: Function
th: ฟังก์ชัน
zh_cn: 功能

source: Position
th: ตำแหน่ง
zh_cn: 职位

# ConfirmDeleteWarning
source: This action will not be rolled back !!
th: การกระทำนี้จะไม่สามารถย้อนกลับได้!!
zh_cn: 此操作将无法撤销！

source: Create Business Customer
th: สร้างลูกค้าธุรกิจ
zh_cn: 创建企业客户

# CreateSucess
source: Create Successfully !!!
th: สร้างสำเร็จ!!!
zh_cn: 创建成功！

source: System Configuration
th: การตั้งค่าระบบ
zh_cn: 系统配置

source: Personal
th: ส่วนตัว
zh_cn: 个人

source: Duplicate codes
th: รหัสซ้ำ
zh_cn: 重复代码

# Còn
source: remains
th: ยังเหลือ
zh_cn: 剩余

# Có Mã EPC Là
source: Has EPC Code Is
th: มีรหัส EPC คือ
zh_cn: 有 EPC 代码是

# database
source: Database Name
th: ชื่อฐานข้อมูล
zh_cn: 数据库名称

source: Warning
th: คำเตือน
zh_cn: 警告

source: Catalog
th: แคตตาล็อก
zh_cn: 目录

# Danh Mục Chính
source: Main Category
th: หมวดหมู่หลัก
zh_cn: 主分类

# Danh Sách
source: List
th: รายการ
zh_cn: 列表

source: Assets detail list
th: รายการรายละเอียดสินทรัพย์
zh_cn: 物料明细列表

source: Customer List
th: รายชื่อลูกค้า
zh_cn: 客户列表

# Danh Sách Khách Hàng Doanh Nghiệp
source: List of Business Customer
th: รายชื่อลูกค้าธุรกิจ
zh_cn: 企业客户列表

# good_group_list
source: Goods Group List
th: รายการกลุ่มสินค้า
zh_cn: 商品组列表

# stock_take_list
source: Stock Count List
th: รายการนับสต็อก
zh_cn: 盘点单列表

# import_form_list
source: Goods Receipt List
th: รายการรับสินค้า
zh_cn: 入库单列表

# export_form_list
source: Goods Issue List
th: รายการออกสินค้า
zh_cn: 出库单列表

# backup_list
source: Backup data list
th: รายการข้อมูลสำรอง
zh_cn: 备份数据列表

# Danh Sách Tài Khoản
source: Account List
th: รายการบัญชี
zh_cn: 账户列表

# units_catalog
source: Units of Measurement
th: หน่วยวัด
zh_cn: 计量单位

source: Data Management
th: การจัดการข้อมูล
zh_cn: 数据管理

# DeleteInfo
source: Delete
th: ลบ
zh_cn: 删除

# DeleteWarning
source: Do You Want To Delete ?
th: คุณต้องการลบข้อมูลนี้หรือไม่?
zh_cn: 您想删除此数据吗？

source: Delivery Bill
th: ใบส่งสินค้า
zh_cn: 发货单

# goods_detail_list
source: Detailed Goods List
th: รายการสินค้ารายละเอียด
zh_cn: 商品明细列表

# Duplicate
source: Duplicate Id !!!
th: รหัสซ้ำ!!!
zh_cn: ID 重复！！！

source: Duplicate Name !!!
th: ชื่อซ้ำ!!!
zh_cn: 名称重复！！！

source: Excess
th: เกิน
zh_cn: 多余

source: Stop
th: หยุด
zh_cn: 停止

source: Stop scanning
th: หยุดการสแกน
zh_cn: 停止扫描

source: Stop RFID scanning
th: หยุดการสแกน RFID
zh_cn: 停止 RFID 扫描

# Dừng Quét HandHeld
source: Stop HandHeld Scan
th: หยุดการสแกนด้วย HandHeld
zh_cn: 停止手持机扫描

# Dữ Liệu Nhập Kho
source: Receipt Data
th: ข้อมูลการรับสินค้า
zh_cn: 入库数据

# Dữ Liệu Xuất Kho
source: Delivery Data
th: ข้อมูลการจัดส่ง
zh_cn: 出库数据

source: Data in Use
th: ข้อมูลที่ใช้งานอยู่
zh_cn: 正在使用的数据

source: Login Data
th: ข้อมูลเข้าสู่ระบบ
zh_cn: 登录数据

source: Edit Business Customer
th: แก้ไขลูกค้าธุรกิจ
zh_cn: 编辑企业客户

source: Edit Group Goods
th: แก้ไขกลุ่มสินค้า
zh_cn: 编辑商品组

source: Edit Type Customer
th: แก้ไขประเภทลูกค้า
zh_cn: 编辑客户类型

source: Edit warehouse
th: แก้ไขคลังสินค้า
zh_cn: 编辑仓库

source: English
th: ภาษาอังกฤษ
zh_cn: 英语

# enter group goods
source: Please Enter Group Goods Name !!!
th: โปรดป้อนชื่อกลุ่มสินค้า!!!
zh_cn: 请输入商品组名称！！！

# enterwarehouse
source: Please Enter Warehouse Name !!!
th: โปรดป้อนชื่อคลังสินค้า!!!
zh_cn: 请输入仓库名称！！！

source: entries
th: รายการ
zh_cn: 条记录

source: Error
th: ข้อผิดพลาด
zh_cn: 错误

source: Export
th: ส่งออก
zh_cn: 导出文件

# FailCreate
source: Create Failure!!!
th: สร้างไม่สำเร็จ!!!
zh_cn: 创建失败！

# FailDelete
source: Delete Failed!
th: ลบไม่สำเร็จ!
zh_cn: 删除失败！

# FailEdit
source: Edit Failed !!!
th: แก้ไขไม่สำเร็จ!!!
zh_cn: 编辑失败！

source: False
th: เท็จ!!!
zh_cn: 错误！！！

# fasle add group goods
source: Product Group Name Already In The System !!!
th: ชื่อกลุ่มผลิตภัณฑ์มีอยู่ในระบบแล้ว!!!
zh_cn: 产品组名称已在系统中！！！

source: Function Configuration
th: การตั้งค่าฟังก์ชัน
zh_cn: 功能配置

source: Note
th: บันทึก
zh_cn: 备注

# Ghi Đè
source: Overwrite
th: เขียนทับ
zh_cn: 覆盖

source: Goods Issue List
th: รายการออกสินค้า
zh_cn: 出库单列表

source: Goods Receipt List
th: รายการรับสินค้า
zh_cn: 入库单列表

# groupgoods sucess
source: Create Group Goods Success
th: สร้างกลุ่มสินค้าสำเร็จ
zh_cn: 创建商品组成功

# Gửi
source: Send
th: ส่ง
zh_cn: 发送

# Hiển Thị Danh Sách Vật Tư Theo
source: Show Assets List By
th: แสดงรายการสินทรัพย์ตาม
zh_cn: 按显示物料列表

source: Recent activities
th: กิจกรรมล่าสุด
zh_cn: 最近活动

# Hoặc Chưa Có Trong Hệ Thống
source: Or Not Yet In The System
th: หรือยังไม่มีในระบบ
zh_cn: 或未在系统中

# Hàng Hóa
source: Goods
th: สินค้า
zh_cn: 商品

# Hàng tồn kho cao nhất
source: Maximum inventory
th: สินค้าคงคลังสูงสุด
zh_cn: 最大库存

# Hàng tồn kho thấp nhất
source: Minimum Inventory
th: สินค้าคงคลังต่ำสุด
zh_cn: 最小库存

source: Actions
th: การกระทำ
zh_cn: 操作

# Hôm nay:
source: Today:
th: วันนี้:
zh_cn: 今天:

source: Debt limit
th: วงเงินหนี้
zh_cn: 债务限额

source: System
th: ระบบ
zh_cn: 系统

source: Full name
th: ชื่อเต็ม
zh_cn: 全名

# Hủy
source: Cancel
th: ยกเลิก
zh_cn: 取消

# Import
source: Inbound
th: นำเข้า
zh_cn: 入库

source: Print
th: พิมพ์
zh_cn: 打印

source: Data Declaration
th: การประกาศข้อมูล
zh_cn: 数据声明

source: Warehouse
th: คลังสินค้า
zh_cn: 仓库

source: Customer
th: ลูกค้า
zh_cn: 客户

# Khách Hàng Không Tồn Tại
source: Customers Don't Exist !!!
th: ลูกค้าไม่มีอยู่!!!
zh_cn: 客户不存在！！！

source: No file selected!
th: ไม่มีไฟล์ที่เลือก!
zh_cn: 未选择文件！

# Không Có Sẵn
source: Unavailable
th: ไม่พร้อมใช้งาน
zh_cn: 不可用

# Không Nhận Được Tất Cả Dữ Liệu
source: Not receiving all data
th: ไม่ได้รับข้อมูลทั้งหมด
zh_cn: 未收到所有数据

# Không Tồn Tại
source: Does Not Exist !!!
th: ไม่มีอยู่!!!
zh_cn: 不存在！！！

# Không Tồn Tại Trong Kho
source: Does Not Exist In Warehouse
th: ไม่มีอยู่ในคลังสินค้า
zh_cn: 不在仓库中

source: Unsatisfactory
th: ไม่เป็นที่น่าพอใจ
zh_cn: 不满意

# Không Đủ Để Xuất
source: Not enough Exports
th: ไม่เพียงพอสำหรับการส่งออก
zh_cn: 数量不足，无法出库

# Kiểm Kho
source: Check Inventory
th: ตรวจสอบสินค้าคงคลัง
zh_cn: 盘点

# stock_take
source: Stock-take Operations
th: การดำเนินการนับสต็อก
zh_cn: 盘点操作

source: Customer type
th: ประเภทลูกค้า
zh_cn: 客户类型

source: Result
th: ผลลัพธ์
zh_cn: 结果

source: Stop locating tags
th: หยุดการระบุตำแหน่งแท็ก
zh_cn: 停止定位标签

# bussiness_customer_list
source: List of Business customer
th: รายชื่อลูกค้าธุรกิจ
zh_cn: 企业客户列表

# customer_type_list
source: Customer Types List
th: รายการประเภทลูกค้า
zh_cn: 客户类型列表

source: Goods List
th: รายการสินค้า
zh_cn: 商品列表

source: List of Group Goods
th: รายการกลุ่มสินค้า
zh_cn: 商品组列表

source: List Of Stock Take
th: รายการการนับสต็อก
zh_cn: 盘点单列表

source: Units List
th: รายการหน่วย
zh_cn: 单位列表

source: Warehouse List
th: รายการคลังสินค้า
zh_cn: 仓库列表

# Liên Hệ Quản Trị Viên Để Được Cấp Lại Mật Khẩu
source: Contact Administrator To Reissue Password ^-^
th: ติดต่อผู้ดูแลระบบเพื่อขอรหัสผ่านใหม่ ^-^
zh_cn: 请联系管理员重新颁发密码 ^-^

# Liên Hệ Quản Trị Viên Để Được Cấp Tài Khoản
source: Contact Administrator To Get Account ^-^
th: ติดต่อผู้ดูแลระบบเพื่อรับบัญชี ^-^
zh_cn: 请联系管理员获取账户 ^-^

# Lên Phiếu Kiểm Kê
source: Up on the Inventory Form
th: บนแบบฟอร์มสินค้าคงคลัง
zh_cn: 创建盘点单

source: Save
th: บันทึก
zh_cn: 保存

# Lưu Thành Công
source: Saved Successfully
th: บันทึกสำเร็จ
zh_cn: 保存成功

# Lưu Tạm Thời
source: Temporary Save
th: บันทึกชั่วคราว
zh_cn: 暂时保存

# Lượng Tồn Của Hàng Hóa
source: The inventory of
th: สินค้าคงคลังของ
zh_cn: 商品的库存量

# Lập Phiếu
source: Create import and export slips
th: สร้างใบนำเข้าและส่งออก
zh_cn: 创建入库和出库单

source: Create Stock-take Form
th: สร้างแบบฟอร์มการนับสต็อก
zh_cn: 创建盘点单

# Lập Phiếu Nhập
source: Goods Receipt
th: ใบรับสินค้า
zh_cn: 创建入库单

# Lập Phiếu Xuất
source: Goods Issue
th: ใบออกสินค้า
zh_cn: 创建出库单

# create_export_form
source: Create Goods Issue
th: สร้างเอกสารการออกสินค้า
zh_cn: 创建出库单

# Lỗi Chi Tiết Phiếu Kiểm
source: Check Voucher Details Error
th: ข้อผิดพลาดในการตรวจสอบรายละเอียดใบสำคัญ
zh_cn: 盘点单详情错误

source: Server
th: เซิร์ฟเวอร์
zh_cn: 服务器

source: ID
th: รหัส

# Mã HH
source: Goods id
th: รหัสสินค้า
zh_cn: 商品ID

# good_id
source: Goods ID
th: รหัสสินค้า
zh_cn: 商品ID

# Mã Hàng Hoặc Kho hàng Không Tồn Tại
source: Product Code or Inventory Does Not Exist
th: รหัสผลิตภัณฑ์หรือสินค้าคงคลังไม่มีอยู่
zh_cn: 产品代码或库存不存在

# Mã Hàng Hóa
source: Goods Id
th: รหัสสินค้า
zh_cn: 商品ID

# mã hàng không tồn tại
source: Goods Id Does Not Exist !!!
th: รหัสสินค้าไม่มีอยู่!!!
zh_cn: 商品ID不存在！！！

# Mã Hàng Trong Danh Sách Chưa Có Trong Phiếu Xuất
source: The Goods Id in the List is not yet included in the Sale Order !!!
th: รหัสสินค้าในรายการยังไม่รวมอยู่ในใบสั่งขาย!!!
zh_cn: 列表中的商品ID尚未包含在销售订单中！！！

# Mã Hàng Trong Danh Sách Không Có Trong Phiếu Nhập
source: The Goods Id in The List is Not Included in The Order
th: รหัสสินค้าในรายการไม่รวมอยู่ในคำสั่งซื้อ
zh_cn: 列表中的商品ID不包含在订单中！！！

# Mã Hàng Trong Danh Sách Không Có Trong Phiếu Xuất
source: The Goods Id in The List is Not Included in The Delivery
th: รหัสสินค้าในรายการไม่รวมอยู่ในการจัดส่ง
zh_cn: 列表中的商品ID不包含在出库中

# mã hàng tồn tại
source: Goods id is aready added in system!!!
th: รหัสสินค้ามีอยู่ในระบบแล้ว!!!
zh_cn: 商品ID已存在于系统中！！！

# customer_code
source: Customer ID
th: รหัสลูกค้า
zh_cn: 客户ID

source: Customer type ID
th: รหัสประเภทลูกค้า
zh_cn: 客户类型ID

# Mã Phiếu Kiểm Không Tồn Tại
source: Check Voucher Code Does Not Exist
th: รหัสใบสำคัญการตรวจสอบไม่มีอยู่
zh_cn: 盘点单号不存在

# valid_po
source: Valid purchase order id!
th: รหัสใบสั่งซื้อถูกต้อง!
zh_cn: 有效的采购订单ID！

# Mã Phiếu Nhập Đã Quét
source: Scanned Purchase Order Id !!!
th: รหัสใบสั่งซื้อที่สแกนแล้ว!!!
zh_cn: 已扫描采购订单ID！！！

# Mã Phiếu Nhập Đã Tồn Tại
source: Receipt Id Already Exists !!!
th: รหัสใบเสร็จมีอยู่แล้ว!!!
zh_cn: 收货单ID已存在！！！

# Mã Phiếu Xuất Hợp Lệ
source: Valid Sale Order Id !!!
th: รหัสใบสั่งขายถูกต้อง!!!
zh_cn: 有效的销售订单ID！！！

# Mã Phiếu Xuất Không Tồn Tại
source: Sale order ID does not exist !!!
th: รหัสใบสั่งขายไม่มีอยู่!!!
zh_cn: 销售订单ID不存在！

# Mã Phiếu Xuất Đã Quét
source: Scanned Sale Order Id !!!
th: รหัสใบสั่งขายที่สแกนแล้ว!!!
zh_cn: 已扫描销售订单ID！！！

# Mã Phiếu Xuất Đã Tồn Tại
source: Sale Order Id Already Exits !!!
th: รหัสใบสั่งขายมีอยู่แล้ว!!!
zh_cn: 销售订单ID已存在！！！

# Mã Phòng Ban
source: Department Id
th: รหัสแผนก
zh_cn: 部门ID

source: Tax code
th: รหัสภาษี
zh_cn: 税号

source: Accounting account code
th: รหัสบัญชีทางการบัญชี
zh_cn: 会计科目代码

# Mã trùng
source: Duplicate code
th: รหัสซ้ำ
zh_cn: 重复代码

# Mã Vật Tư
source: Asset Id
th: รหัสสินทรัพย์
zh_cn: 物料ID

source: Description
th: คำอธิบาย
zh_cn: 描述

# Mô Tả Nếu Có Hàng Dư hoặc Khác
source: Description If There Is Excess Stock or Other
th: คำอธิบายหากมีสินค้าเกินหรืออื่นๆ
zh_cn: 如果有多余或不同商品，请描述

source: Sample
th: ตัวอย่าง
zh_cn: 样本

source: Password
th: รหัสผ่าน
zh_cn: 密码

# Mục Đích
source: Purpose
th: วัตถุประสงค์
zh_cn: 目的

source: Customer resources
th: แหล่งที่มาของลูกค้า
zh_cn: 客户来源

source: Career
th: อาชีพ
zh_cn: 行业

source: Datetime
th: วันที่และเวลา
zh_cn: 日期时间

# Ngày Mua
source: Date Buy
th: วันที่ซื้อ
zh_cn: 购买日期

# Ngày Sinh
source: Date Of Birth
th: วันเกิด
zh_cn: 出生日期

source: Modify date
th: วันที่แก้ไข
zh_cn: 修改日期

source: Create date
th: วันที่สร้าง
zh_cn: 创建日期

# Ngày Tạo Đơn Hàng
source: Order Creation Date
th: วันที่สร้างคำสั่งซื้อ
zh_cn: 订单创建日期

source: Export date
th: วันที่ส่งออก
zh_cn: 订单出库日期

source: Deliver
th: ผู้จัดส่ง
zh_cn: 发货人

source: Backup_operator
th: ผู้ดำเนินการสำรองข้อมูล
zh_cn: 备份操作员

# Người Sở Hữu
source: Owner
th: เจ้าของ
zh_cn: 所有者

source: Modify by
th: แก้ไขโดย
zh_cn: 修改人

source: Create by
th: สร้างโดย
zh_cn: 创建人

# NhapKhoQuaSL
source: The quantity of imported goods exceeds the allowable quantity of
th: ปริมาณสินค้าที่นำเข้าเกินปริมาณที่อนุญาตของ
zh_cn: 入库数量超出允许的数量

source: Staff
th: พนักงาน
zh_cn: 员工

source: Stock auditor
th: ผู้ตรวจสอบสต็อก
zh_cn: 盘点员

# Nhân Viên Kiểm Hàng 1
source: Goods Inspection Staff 1
th: พนักงานตรวจสอบสินค้า 1
zh_cn: 验货员 1

# Nhân Viên Kiểm Hàng 2
source: Goods Inspection Staff 2
th: พนักงานตรวจสอบสินค้า 2
zh_cn: 验货员 2

source: Staff in charge
th: พนักงานที่รับผิดชอบ
zh_cn: 负责人

# Nhóm Hàng
source: Group Goods
th: กลุ่มสินค้า
zh_cn: 商品组

# Nhóm Hàng Hóa
source: Group of goods
th: กลุ่มสินค้า
zh_cn: 商品组

source: Press the button
th: กดปุ่ม
zh_cn: 按此按钮

source: Import file
th: นำเข้าไฟล์
zh_cn: 导入文件

# Nhập Kho Vượt Quá
source: Warehouse In Excess
th: คลังสินค้าเกิน
zh_cn: 仓库入库超量

# nhập mã hàng
source: Please Enter Goods Id !!!
th: โปรดป้อนรหัสสินค้า!!!
zh_cn: 请输入商品ID！！！

source: Enter good ID
th: ป้อนรหัสสินค้า
zh_cn: 输入商品ID

# nhập số lượng cao nhất
source: Please Enter The Maximum Quantity !!!
th: โปรดป้อนปริมาณสูงสุด!!!
zh_cn: 请输入最大数量！！！

# Nhập Số Lượng Hàng Tồn Kho Cao Nhất
source: Enter The Maximum Inventory
th: ป้อนปริมาณสินค้าคงคลังสูงสุด
zh_cn: 输入最大库存量

# Nhập Số Lượng Hàng Tồn Kho Thấp Nhất
source: Enter The Minimum Inventory
th: ป้อนปริมาณสินค้าคงคลังขั้นต่ำ
zh_cn: 输入最小库存量

# nhập số lượng thấp nhất
source: Please Enter The Minimum Quantity !!!
th: โปรดป้อนปริมาณขั้นต่ำ!!!
zh_cn: 请输入最小数量！！！

source: Enter inventory quantity
th: ป้อนปริมาณสินค้าคงคลัง
zh_cn: 输入库存量

# Nhập thông tin chi tiết của bạn để đăng nhập vào tài khoản của bạn
source: Enter Your Details To Login To Your Account:
th: ป้อนรายละเอียดของคุณเพื่อเข้าสู่บัญชีของคุณ:
zh_cn: 输入您的详细信息以登录您的账户：

# nhập tên hàng
source: Please Enter Goods Name !!!
th: โปรดป้อนชื่อสินค้า!!!
zh_cn: 请输入商品名称！！！

# Nhập Tên Hàng Hóa
source: Enter Goods Name
th: ป้อนชื่อสินค้า
zh_cn: 输入商品名称

# nhập tên nhóm hàng
source: Please Enter Group Goods Name !!!
th: โปรดป้อนชื่อกลุ่มสินค้า!!!
zh_cn: 请输入商品组名称！！！

# nhập tên đơn vị
source: Please Enter Unit Name !!!
th: โปรดป้อนชื่อหน่วย!!!
zh_cn: 请输入单位名称！！！

# Nhập Tại Kho
source: At Warehouse
th: ที่คลังสินค้า
zh_cn: 在仓库入库

# import_export
source: Inbound - Outbound
th: นำเข้า - ส่งออก
zh_cn: 入库 - 出库

# Nhập Đủ Số Phiếu Nhập
source: Enter Enough Number of Receipt !!!
th: ป้อนหมายเลขใบเสร็จให้เพียงพอ!!!
zh_cn: 请输入足够的收货单号！！！

# Nhập Đủ Số Phiếu Xuất
source: Enter Enough Number of Sale Order!!!
th: ป้อนหมายเลขใบสั่งขายให้เพียงพอ!!!
zh_cn: 请输入足够的销售订单号！！！

# Phiếu Kiểm
source: Stock-take ID
th: รหัสการนับสต็อก
zh_cn: 盘点单号

source: Import form
th: แบบฟอร์มนำเข้า
zh_cn: 入库单

# Phiếu Nhập Kho
source: Receipt
th: ใบเสร็จรับเงิน
zh_cn: 收货单

# Phiếu Xuất
source: Goods Issue
th: ใบออกสินค้า
zh_cn: 出库单

# Phiếu Xuất Kho
source: Delivery Bill
th: ใบส่งสินค้า
zh_cn: 发货单

source: Export form
th: แบบฟอร์มส่งออก
zh_cn: 出库单

# Phân Quyền Chức Năng
source: Decentralization of Functions
th: การกระจายอำนาจของฟังก์ชัน
zh_cn: 功能权限分配

# Phân Quyền Quản Lý
source: Decentralization of Management
th: การกระจายอำนาจการจัดการ
zh_cn: 管理权限分配

# Phòng Ban
source: Department
th: แผนก
zh_cn: 部门

source: Scanning method
th: วิธีการสแกน
zh_cn: 扫描方式

source: Payment methods
th: วิธีการชำระเงิน
zh_cn: 付款方式

# Phụ Lục
source: Addendum
th: ภาคผนวก
zh_cn: 附录

source: Purchase Order
th: ใบสั่งซื้อ
zh_cn: 采购订单

source: System Permissions and Functions
th: สิทธิ์และฟังก์ชันของระบบ
zh_cn: 系统权限和功能

source: Scan
th: สแกน
zh_cn: 扫描

# Quét HandHeld
source: HandHeld Scan
th: สแกนด้วย HandHeld
zh_cn: 手持机扫描

source: Rescan duplicate code
th: สแกนรหัสซ้ำอีกครั้ง
zh_cn: 重新扫描重复代码

source: Rescan All
th: สแกนทั้งหมดอีกครั้ง
zh_cn: 重新扫描全部

# Quên Mật Khẩu
source: Forgot password ?
th: ลืมรหัสผ่าน?
zh_cn: 忘记密码？

# warehouse_catalog
source: Warehouse
th: คลังสินค้า
zh_cn: 仓库

# Quản Lý Danh Mục Sản Phẩm
source: Manage Main Categories
th: จัดการหมวดหมู่หลัก
zh_cn: 管理主分类

# Quản Lý Danh Mục Tài Khoản
source: Account Manager
th: ผู้จัดการบัญชี
zh_cn: 账户管理

# Quản Lý Hệ Thống
source: System Management
th: การจัดการระบบ
zh_cn: 系统管理

# Quản Lý Kho
source: Warehouse Management
th: การจัดการคลังสินค้า
zh_cn: 仓库管理

source: Warehouse Management
th: การจัดการคลังสินค้า
zh_cn: 仓库管理

# Quản Lý Nhập Hàng
source: Purchase Manager
th: ผู้จัดการการซื้อ
zh_cn: 采购管理

source: Account Management
th: การจัดการบัญชี
zh_cn: 账户管理

# Quản Lý Xuất Hàng
source: Sales Manager
th: ผู้จัดการฝ่ายขาย
zh_cn: 销售管理

source: Receip Data
th: ข้อมูลรับสินค้า
zh_cn: 收货数据

source: Receipt
th: ใบเสร็จรับเงิน
zh_cn: 收货单

source: Remains
th: ยังเหลือ
zh_cn: 剩余

source: Sales Order
th: ใบสั่งขาย
zh_cn: 销售订单

source: Backup
th: สำรอง
zh_cn: 备份

source: SQL server backup
th: การสำรองข้อมูล SQL Server
zh_cn: SQL 服务器备份

source: Show
th: แสดง
zh_cn: 显示

# serial_number
source: No.
th: เลขที่
zh_cn: 序号

# SucessDelete
source: Delete Successfully!
th: ลบสำเร็จ!
zh_cn: 删除成功！

# SucessEdit
source: Update Sucessfully!
th: อัปเดตสำเร็จ!
zh_cn: 更新成功！

source: System functions
th: ฟังก์ชันระบบ
zh_cn: 系统功能

source: Fax number
th: หมายเลขแฟกซ์
zh_cn: 传真号码

source: Quantity
th: ปริมาณ
zh_cn: 数量

# Số Lượng Hàng Hóa Trong Kho Không Đủ Để Xuất
source: The Quantity of Goods in Warehouse is Not Enough for Export!!!
th: ปริมาณสินค้าในคลังสินค้าไม่เพียงพอสำหรับการส่งออก!!!
zh_cn: 仓库中商品数量不足以出库！！！

# Số Lượng Hàng Nhập Kho
source: Quantity Of Imported Goods
th: ปริมาณสินค้าที่นำเข้า
zh_cn: 入库商品数量

source: Stock-take quantity
th: ปริมาณการนับสต็อก
zh_cn: 盘点数量

# Số Lượng Nhập Vượt Quá Số Lượng Cho Phép Của Kho
source: Imported Quantity Exceeds the Warehouse's Allowed Quantity
th: ปริมาณที่นำเข้าเกินปริมาณที่คลังสินค้าอนุญาต
zh_cn: 入库数量超出仓库允许的数量

# Số Lượng Tương Đồng
source: Similar Quantities
th: ปริมาณที่คล้ายกัน
zh_cn: 相似数量

source: Quantity of inventory
th: ปริมาณสินค้าคงคลัง
zh_cn: 库存数量

# assets_quantity
source: Asset quantity
th: ปริมาณสินทรัพย์
zh_cn: 物料数量

source: Number of scanned goods
th: จำนวนสินค้าที่สแกน
zh_cn: 已扫描数量

# Số Lượng, Vui Lòng Giảm
source: Quantities, Please Reduce it.
th: ปริมาณ โปรดลดลง
zh_cn: 数量，请减少！！！

# Số Lượng, Vui Lòng Nhập Thêm
source: Quantities Left, Please enter more !!!
th: ปริมาณที่เหลือ โปรดป้อนเพิ่มเติม!!!
zh_cn: 数量，请再输入！！！

source: Number of days allowed for debt
th: จำนวนวันที่อนุญาตให้เป็นหนี้
zh_cn: 允许欠款天数

source: Number of unscanned Import forms
th: จำนวนแบบฟอร์มนำเข้าที่ยังไม่ได้สแกน
zh_cn: 未扫描的入库单数量

# Số Phiếu Nhập Kho
source: Goods Receipt Id
th: รหัสใบรับสินค้า
zh_cn: 收货单号

source: Number of unscanned Export forms
th: จำนวนแบบฟอร์มส่งออกที่ยังไม่ได้สแกน
zh_cn: 未扫描的出库单数量

# export_form_code
source: Export form ID
th: รหัสแบบฟอร์มส่งออก
zh_cn: 出库单号

# Số Phiếu Yêu Cầu Nhập
source: Purchase Order Id
th: รหัสใบสั่งซื้อ
zh_cn: 采购订单号

source: Sale Order ID
th: รหัสใบสั่งขาย
zh_cn: 销售订单ID

source: Account number 1
th: หมายเลขบัญชี 1
zh_cn: 账户号 1

source: Account number 2
th: หมายเลขบัญชี 2
zh_cn: 账户号 2

source: Phone number
th: หมายเลขโทรศัพท์
zh_cn: 电话号码

source: Edit
th: แก้ไข
zh_cn: 编辑

# edit_good
source: Edit goods
th: แก้ไขสินค้า
zh_cn: 编辑商品

# Sửa Kho Hàng
source: Edit Warehouse
th: แก้ไขคลังสินค้า
zh_cn: 编辑仓库

# edit_customer_infor
source: Edit Customer information
th: แก้ไขข้อมูลลูกค้า
zh_cn: 编辑客户信息

# Sửa Khách Hàng Doanh Nghiệp
source: Edit Business Customers
th: แก้ไขลูกค้าธุรกิจ
zh_cn: 编辑企业客户

# Sửa Loại Khách Hàng
source: Edit Type Customer
th: แก้ไขประเภทลูกค้า
zh_cn: 编辑客户类型

# edit_good_group
source: Edit goods group
th: แก้ไขกลุ่มสินค้า
zh_cn: 编辑商品组

source: Edit unit
th: แก้ไขหน่วย
zh_cn: 编辑单位

# The inventory of good
source: The inventory of
th: สินค้าคงคลังของ
zh_cn: 商品的库存量

# Theo Phòng Ban
source: Department
th: แผนก
zh_cn: 按部门

# Theo Vật Tư
source: Assets
th: สินทรัพย์
zh_cn: 按物料

source: Setup
th: การตั้งค่า
zh_cn: 设置

source: Deficiency
th: ขาดแคลน
zh_cn: 不足

# Thoát
source: Exit
th: ออก
zh_cn: 退出

# Thuộc Nhóm Hàng
source: Belongs To The Group Goods
th: เป็นของกลุ่มสินค้า
zh_cn: 属于商品组

# Thuộc Đơn Vị
source: Belongs To The Unit
th: เป็นของหน่วย
zh_cn: 属于单位

source: Success
th: สำเร็จ
zh_cn: 成功

source: Add
th: เพิ่ม
zh_cn: 添加

# Thêm Chức Năng
source: Add Function
th: เพิ่มฟังก์ชัน
zh_cn: 添加功能

source: Add new customer
th: เพิ่มลูกค้าใหม่
zh_cn: 添加新客户

# add_customers_organization
source: Add new customer (Organization)
th: เพิ่มลูกค้าใหม่ (องค์กร)
zh_cn: 添加新客户 (组织)

# add_bussiness_customers
source: Create New Business Customers
th: สร้างลูกค้าธุรกิจใหม่
zh_cn: 创建新企业客户

# Thêm Loại Khách Hàng
source: Add Type Customer
th: เพิ่มประเภทลูกค้า
zh_cn: 添加客户类型

# Thêm Nhóm Hàng
source: Add Group Goods
th: เพิ่มกลุ่มสินค้า
zh_cn: 添加商品组

# Thêm Tài Khoản
source: Add User
th: เพิ่มผู้ใช้
zh_cn: 添加用户

# add_units
source: Add New Unit
th: เพิ่มหน่วยใหม่
zh_cn: 添加新单位

source: Notification
th: การแจ้งเตือน
zh_cn: 通知

source: Information
th: ข้อมูล
zh_cn: 信息

# other_info
source: Other information
th: ข้อมูลอื่นๆ
zh_cn: 其他信息

# user_info
source: User information
th: ข้อมูลผู้ใช้
zh_cn: 用户信息

# Thương Hiệu
source: Brands
th: แบรนด์
zh_cn: 品牌

source: Membership card
th: บัตรสมาชิก
zh_cn: 会员卡

# Thừa
source: Excess
th: เกิน
zh_cn: 多余

source: Messages
th: ข้อความ
zh_cn: 消息

source: Total goods inventory
th: สินค้าคงคลังรวม
zh_cn: 总商品库存

source: Home
th: หน้าหลัก
zh_cn: 首页

# Trong
source: In
th: ใน
zh_cn: 在

source: Recent access
th: การเข้าถึงล่าสุด
zh_cn: 最近访问

# trùng tên nhóm hàng
source: Product Group Name Already In The System !!!
th: ชื่อกลุ่มผลิตภัณฑ์มีอยู่ในระบบแล้ว!!!
zh_cn: 产品组名称已在系统中！！！
